# NumPy, Pandas, Matplotlib

- NumPy
- creation of numpy array
- array()
- arange()
- linspace()
- zeros()
- Ones()
- full()
- eye()
- identity()
- diag()
- empty()
- random library function

- randint()
- rand()
- uniform()
- randn()
- normal()
- shuffle()
-------------------------

- Array attributes & numpy data types
- view vs copy

------------------

- Indexing, Slicing and advance Indexing
- basic indexing- to select only one element
- slicing - to select multiple arbitrary element
- condition based selection

------------------

- how to iterate element of the nd array

- by python loop
- by numpy nditer() function
- by using ndenumerate() function

------------------

Arithmetics operation:
- arithmetics operation for numpy array with scaler
- arithmetics operation for array with array


----------------------
Array manipulation function

- reshape()
- resize() 
- flatten()
- flat variable
- ravel()
- transpose()
- swapaxes()


--------------
- Joining of multiple array into a single array

- concatenate()
- stack()
- vstack()
- hstack()
- dstack()

--------------
- splitting of array 

- split()
- vsplit()
- hsplit()
- dsplit()

--------------
- how to insert element from ndarray

- insert()
- append()

---------------

- deleting element from ndarray
- matrix multiplication
- importance of matrix class in numpy library.

--------------
- Linear algebra function from linalg module
- inv() - to find the inverse of matrix
- matrix_power() - to find the power of matrix A^n
- det() - to find the determinant of matrix
- solve() - to solve the linear algebra question
-  I/O  operation with numpy 
- basic statistics with numpy
- numpy mathematics function
- how to find unique items and count.

In [ ]:
"""
Pre requisite-
 Data type
 loop
 function
 
"""

'\nPre requisite-\n Data type\n loop\n function\n \n'

- Numpy stand for numerical python 
- to deal with arrays based computing + complex operation
- travis oliphan developed numpy 
- he developed numpy in C, Python language.

In [1]:
lst=[[10,20],[30,40]]
print(lst)

[[10, 20], [30, 40]]

In [2]:
for row in lst:
    print(row)

[10, 20]
[30, 40]

In [3]:
""""
- ndarray - mean n dimension array
- pip install numpy

- to uninstall
pip uninstall numpy

# to install and uninstall you need internet connection
because pip is connected to github

-to find the version of numpy
import numpy
print(np.__version__)

"""

'"\n- ndarray - mean n dimension array\n- pip install numpy\n\n- to uninstall\npip uninstall numpy\n\n# to install and uninstall you need internet connection\nbecause pip is connected to github\n\n-to find the version of numpy\nimport numpy\nprint(np.__version__)\n\n'

In [4]:
import numpy as np
print(np.__version__)

2.2.2

In [5]:
lst=[10,20,30,40,50,60,15,10,35,20,30]
a=np.array(lst)
print(a,type(a))

[10 20 30 40 50 60 15 10 35 20 30] <class 'numpy.ndarray'>

In [6]:
a=a+1
print(a,type(a))

[11 21 31 41 51 61 16 11 36 21 31] <class 'numpy.ndarray'>

In [7]:
# how to find the memory size 
import sys
lst1=[10,20,30]
print(sys.getsizeof(lst1))

88

In [8]:
# vector based operation is done with numpy.
# nd array take less memory space for large scale data 
#

# Numpy

"""  
- numpy stand for numerical python .
- numpy is one of the pre define third party module / library and numpy module is not pre define module in python.
- syntax for installing any module in python:
    pip install numpy
    
- to use numpy as a part of our program , we must import numpy module.
- a numpy module is collection of variable, function, and classes.
____________________

History of numpy:-

- developed in 2005 by travis oliphan.
- to solve complex math.
- numpy is developed in c and python language.

- in numpy programming , data is organise in the object of "ndarray". which is one of the pre defined class in numpy.
- hence object of ndarray can store same type or different type ( unique+duplicate ) in single object.

__________________________

# Advantage of numpy.

- with revolution of data science , data analysis like numpy, scipy, scikit and pandas etc., have seen a lot of growth.
- numpy provide a convenient and efficient way to handle the vast amount of data .
- numpy can also do matrix operation and data reshaping.
- numpy is fast which makes it resonable to work with large set of data.


- we can perform 1d,2d ,3d multi dimension array.
- numpy maintain minimal memory for large of data .
-  numpy provide fast in performing operation because it internally its data is available at same address.
- numpy provide many inbuilt function for various complex mathematics operation such as statistical, algebraic, trigonometric, financial and many more.
    
"""

# number of ways to create an object of ndarray:-

 
# i want to create a object of list:-
- lst1=list()
#or
- lst2=[]
#or 
- lst3=list({v1,v2,v3})
#or
lst4=list((v1,v2,v3))

In [9]:
# in numpy we can create an object of ndarray with the following ways:-

#1. array()
#2. arange()
#3. linspace()
#4. zeros()
#5. ones()
#6. full()
#7. identity()
#8. eye()
#9. hstack()
#10. vstack()


#numpy.random 
    #a. randint()
    #b. rand()
    #c. uniform()
    #d. randn()
    #e. normal()
    #f. shuffle()

In [10]:
#pip show numpy
#pip list

# 1. array()
- syntax:-
- varname=numpy.array(object,dtype)
- this function is used  for converting traditional python objects into ndarray object

In [11]:
import numpy as np
b=90
a=np.array(b)
print(a,type(a))

90 <class 'numpy.ndarray'>

In [12]:
print(a.ndim)

0

In [13]:
print(a.shape)

()

In [14]:
print(a.size)

1

In [15]:
print(a.dtype)

int64

In [16]:
b=3.4
a=np.array(b)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

3.4 <class 'numpy.ndarray'>
dimension 0
shape ()
size 1
internal data type float64

In [17]:
b=3.4+4.5j
a=np.array(b)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

(3.4+4.5j) <class 'numpy.ndarray'>
dimension 0
shape ()
size 1
internal data type complex128

In [18]:
b="python"
a=np.array(b)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

python <class 'numpy.ndarray'>
dimension 0
shape ()
size 1
internal data type <U6

In [19]:
for val in range(1,11):
    print(val,end="\t")

1	2	3	4	5	6	7	8	9	10

In [20]:
r=range(10,51,2)
a=np.array(r)
print(a,end="\t")

[10 12 14 16 18 20 22 24 26 28 30 32 34 36 38 40 42 44 46 48 50]

In [21]:
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[10 12 14 16 18 20 22 24 26 28 30 32 34 36 38 40 42 44 46 48 50] <class 'numpy.ndarray'>
dimension 1
shape (21,)
size 21
internal data type int64

In [22]:
a=np.array(range(6),dtype=bool)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[False  True  True  True  True  True] <class 'numpy.ndarray'>
dimension 1
shape (6,)
size 6
internal data type bool

In [23]:
a=np.array(range(6),dtype=int)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[0 1 2 3 4 5] <class 'numpy.ndarray'>
dimension 1
shape (6,)
size 6
internal data type int64

# now i want to reshape the 1D to 2D array:-

- syntax: for shape attribute
- ndarrayobj.shape=(rows,cols)
-  syntax: for reshape attribute
- ndarrayobj=ndarrayobj.reshape(rows,cols)

In [24]:
a=np.array(range(100,156,5))
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[100 105 110 115 120 125 130 135 140 145 150 155] <class 'numpy.ndarray'>
dimension 1
shape (12,)
size 12
internal data type int64

In [25]:
a.shape=(4,3)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[[100 105 110]
 [115 120 125]
 [130 135 140]
 [145 150 155]] <class 'numpy.ndarray'>
dimension 2
shape (4, 3)
size 12
internal data type int64

In [26]:
a.shape=(12,)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[100 105 110 115 120 125 130 135 140 145 150 155] <class 'numpy.ndarray'>
dimension 1
shape (12,)
size 12
internal data type int64

In [27]:
a.reshape(4,3)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[100 105 110 115 120 125 130 135 140 145 150 155] <class 'numpy.ndarray'>
dimension 1
shape (12,)
size 12
internal data type int64

In [28]:
a=a.reshape(12,)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[100 105 110 115 120 125 130 135 140 145 150 155] <class 'numpy.ndarray'>
dimension 1
shape (12,)
size 12
internal data type int64

In [29]:
a=np.array(range(0,16))
a.shape=(2,2,2,2)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[[[[ 0  1]
   [ 2  3]]

  [[ 4  5]
   [ 6  7]]]


 [[[ 8  9]
   [10 11]]

  [[12 13]
   [14 15]]]] <class 'numpy.ndarray'>
dimension 4
shape (2, 2, 2, 2)
size 16
internal data type int64

In [30]:
lst=[10,20,30,40,50,60,70,80,90,100,110,120,130,140,160]
a.shape=(4,4)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]
 [12 13 14 15]] <class 'numpy.ndarray'>
dimension 2
shape (4, 4)
size 16
internal data type int64

In [31]:
a.shape=(2,2,4)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[[[ 0  1  2  3]
  [ 4  5  6  7]]

 [[ 8  9 10 11]
  [12 13 14 15]]] <class 'numpy.ndarray'>
dimension 3
shape (2, 2, 4)
size 16
internal data type int64

In [32]:
# to flatten
a.shape=(16,)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15] <class 'numpy.ndarray'>
dimension 1
shape (16,)
size 16
internal data type int64

In [33]:
s1={10,20,30,40,50,60}
print(s1,type(s1))

{50, 20, 40, 10, 60, 30} <class 'set'>

In [34]:
a=np.array(s1)

print(a,type(a))

{50, 20, 40, 10, 60, 30} <class 'numpy.ndarray'>

In [35]:
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

{50, 20, 40, 10, 60, 30} <class 'numpy.ndarray'>
dimension 0
shape ()
size 1
internal data type object

In [36]:
d1={10:"python",20:"java",30:"c",40:"c++"}

a=np.array(d1)
print(a,type(a))
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

{10: 'python', 20: 'java', 30: 'c', 40: 'c++'} <class 'numpy.ndarray'>
{10: 'python', 20: 'java', 30: 'c', 40: 'c++'} <class 'numpy.ndarray'>
dimension 0
shape ()
size 1
internal data type object

# 2. arange()
- arange() is used for generating range of values with equal interval of value(default interval value or step value is 1)
- syntax:-
- varname=numpy.arange(start)
- varname=numpy.arange(start,end)
- varname=numpy.arange(start,end,step)

- arange() by default create an object of ndarray with 1D  array only ,it cannot built 2D and n-dimension array

- to built 2D and n-D array from arange() function we use reshape() or shape attribute.

In [37]:
import numpy as np
a=np.arange(10)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[0 1 2 3 4 5 6 7 8 9] <class 'numpy.ndarray'>
dimension 1
shape (10,)
size 10
internal data type int64

In [38]:
a.shape=(5,2)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[[0 1]
 [2 3]
 [4 5]
 [6 7]
 [8 9]] <class 'numpy.ndarray'>
dimension 2
shape (5, 2)
size 10
internal data type int64

In [39]:
a=np.arange(10,22)
print(a,type(a),len(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[10 11 12 13 14 15 16 17 18 19 20 21] <class 'numpy.ndarray'> 12
dimension 1
shape (12,)
size 12
internal data type int64

In [40]:
a.shape=(2,2,3)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[[[10 11 12]
  [13 14 15]]

 [[16 17 18]
  [19 20 21]]] <class 'numpy.ndarray'>
dimension 3
shape (2, 2, 3)
size 12
internal data type int64

In [41]:
a=np.arange(10,22).reshape(2,3,2)
print(a,type(a))

[[[10 11]
  [12 13]
  [14 15]]

 [[16 17]
  [18 19]
  [20 21]]] <class 'numpy.ndarray'>

In [42]:
a=np.arange(10,106,5).reshape(5,4)
print(a,type(a),len(a))

[[ 10  15  20  25]
 [ 30  35  40  45]
 [ 50  55  60  65]
 [ 70  75  80  85]
 [ 90  95 100 105]] <class 'numpy.ndarray'> 5

# linspace()
- syntax:-
- varname=numpy.linspace(start,stop,num,endpoint,restep,dtype)
-

In [43]:
a=np.linspace(1,2)

print(a,type(a))

[1.         1.02040816 1.04081633 1.06122449 1.08163265 1.10204082
 1.12244898 1.14285714 1.16326531 1.18367347 1.20408163 1.2244898
 1.24489796 1.26530612 1.28571429 1.30612245 1.32653061 1.34693878
 1.36734694 1.3877551  1.40816327 1.42857143 1.44897959 1.46938776
 1.48979592 1.51020408 1.53061224 1.55102041 1.57142857 1.59183673
 1.6122449  1.63265306 1.65306122 1.67346939 1.69387755 1.71428571
 1.73469388 1.75510204 1.7755102  1.79591837 1.81632653 1.83673469
 1.85714286 1.87755102 1.89795918 1.91836735 1.93877551 1.95918367
 1.97959184 2.        ] <class 'numpy.ndarray'>

In [44]:
a=np.linspace(1,2,num=5)
print(a,type(a))

[1.   1.25 1.5  1.75 2.  ] <class 'numpy.ndarray'>

In [45]:
a=np.linspace(1,2,num=5,endpoint=False)
print(a,type(a))

[1.  1.2 1.4 1.6 1.8] <class 'numpy.ndarray'>

In [46]:
a=np.linspace(1,2,num=5,retstep=True)
print(a,type(a))

(array([1.  , 1.25, 1.5 , 1.75, 2.  ]), np.float64(0.25)) <class 'tuple'>

# zeros()
- syntax:-
- varname=numpy.zeros(shape,dtype)

In [47]:
l1=[0,0,0,0]
a=np.array(l1)
print(a,type(a))
a.shape=(2,2)
print(a,type(a))

[0 0 0 0] <class 'numpy.ndarray'>
[[0 0]
 [0 0]] <class 'numpy.ndarray'>

In [48]:
a=np.zeros((2,2),dtype=int)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[[0 0]
 [0 0]] <class 'numpy.ndarray'>
dimension 2
shape (2, 2)
size 4
internal data type int64

In [49]:
a=np.zeros((3,3,3),dtype=int)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[[[0 0 0]
  [0 0 0]
  [0 0 0]]

 [[0 0 0]
  [0 0 0]
  [0 0 0]]

 [[0 0 0]
  [0 0 0]
  [0 0 0]]] <class 'numpy.ndarray'>
dimension 3
shape (3, 3, 3)
size 27
internal data type int64

# ones()
- syntax:-
-

In [50]:
a=np.ones(3,dtype=int)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[1 1 1] <class 'numpy.ndarray'>
dimension 1
shape (3,)
size 3
internal data type int64

In [51]:
a=np.ones((2,3,4),dtype=int)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)
#a= numpy.ones((dimension,rows,columns),dtype=int)

[[[1 1 1 1]
  [1 1 1 1]
  [1 1 1 1]]

 [[1 1 1 1]
  [1 1 1 1]
  [1 1 1 1]]] <class 'numpy.ndarray'>
dimension 3
shape (2, 3, 4)
size 24
internal data type int64

# full()
- syntax:-
- varname=numpy.full(shape,fill_value,dtype)

In [52]:
a=np.full(6,9)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[9 9 9 9 9 9] <class 'numpy.ndarray'>
dimension 1
shape (6,)
size 6
internal data type int64

In [53]:
a=np.full(6,9).reshape(2,3)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[[9 9 9]
 [9 9 9]] <class 'numpy.ndarray'>
dimension 2
shape (2, 3)
size 6
internal data type int64

In [54]:
a=np.full((3,3),6)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[[6 6 6]
 [6 6 6]
 [6 6 6]] <class 'numpy.ndarray'>
dimension 2
shape (3, 3)
size 9
internal data type int64

In [55]:
a=np.full((3,3,3),6)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[[[6 6 6]
  [6 6 6]
  [6 6 6]]

 [[6 6 6]
  [6 6 6]
  [6 6 6]]

 [[6 6 6]
  [6 6 6]
  [6 6 6]]] <class 'numpy.ndarray'>
dimension 3
shape (3, 3, 3)
size 27
internal data type int64

In [56]:
a=np.full((3,3,3),"itty")
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[[['itty' 'itty' 'itty']
  ['itty' 'itty' 'itty']
  ['itty' 'itty' 'itty']]

 [['itty' 'itty' 'itty']
  ['itty' 'itty' 'itty']
  ['itty' 'itty' 'itty']]

 [['itty' 'itty' 'itty']
  ['itty' 'itty' 'itty']
  ['itty' 'itty' 'itty']]] <class 'numpy.ndarray'>
dimension 3
shape (3, 3, 3)
size 27
internal data type <U4

# identity()
- syntax:-
- varname=numpy.identity(N,dtype)

In [57]:
a=np.identity(3)
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("internal data type",a.dtype)

[[1. 0. 0.]
 [0. 1. 0.]
 [0. 0. 1.]] <class 'numpy.ndarray'>
dimension 2
shape (3, 3)
size 9
internal data type float64

# eye()

- varname= numpy.eye(N,M=none,k=0,dtype)

In [58]:
a= np.identity(5,dtype=int)
print(a,type(a))

[[1 0 0 0 0]
 [0 1 0 0 0]
 [0 0 1 0 0]
 [0 0 0 1 0]
 [0 0 0 0 1]] <class 'numpy.ndarray'>

In [59]:
a= np.eye(5,dtype=int)
print(a,type(a))

[[1 0 0 0 0]
 [0 1 0 0 0]
 [0 0 1 0 0]
 [0 0 0 1 0]
 [0 0 0 0 1]] <class 'numpy.ndarray'>

In [60]:
a= np.eye(5,k=-1,dtype=int)
print(a,type(a))

[[0 0 0 0 0]
 [1 0 0 0 0]
 [0 1 0 0 0]
 [0 0 1 0 0]
 [0 0 0 1 0]] <class 'numpy.ndarray'>

In [61]:
a= np.eye(5,k=-2,dtype=int)
print(a,type(a))

[[0 0 0 0 0]
 [0 0 0 0 0]
 [1 0 0 0 0]
 [0 1 0 0 0]
 [0 0 1 0 0]] <class 'numpy.ndarray'>

In [62]:
a= np.eye(3,5,dtype=int)
print(a,type(a))

[[1 0 0 0 0]
 [0 1 0 0 0]
 [0 0 1 0 0]] <class 'numpy.ndarray'>

In [63]:
a= np.eye(5,3,dtype=int)
print(a,type(a))

[[1 0 0]
 [0 1 0]
 [0 0 1]
 [0 0 0]
 [0 0 0]] <class 'numpy.ndarray'>

# Random number generation in numpy:-
- numpy.random
- 1. randint()
- 2. rand()
- 3. uniform()
- 4. randn()
- 5. normal()
- 6. shuffle()


- --> these are very much useful data science algorithm.(random number generation in numpy:-)

In [64]:
import numpy as np
""" 
_____________________________________  
 1. randint() :- 
 syntax:-
 randint(low, high=None, size=None, dtype=int)
_____________________________________
- 2. rand()
_____________________________________
- 3. uniform()
_____________________________________
- 4. randn()
_____________________________________
- 5. normal()
_____________________________________
- 6. shuffle()
_____________________________________



"""

' \n_____________________________________  \n 1. randint() :- \n syntax:-\n randint(low, high=None, size=None, dtype=int)\n_____________________________________\n- 2. rand()\n_____________________________________\n- 3. uniform()\n_____________________________________\n- 4. randn()\n_____________________________________\n- 5. normal()\n_____________________________________\n- 6. shuffle()\n_____________________________________\n\n\n\n'

In [65]:
a=np.random.randint(10)
print(a,type(a))

6 <class 'int'>

In [66]:
a=np.random.randint(10,30,size=(10,20))
print(a,type(a))

[[27 23 16 29 22 15 20 10 23 12 28 21 16 11 15 10 12 25 26 29]
 [27 16 26 26 16 26 26 12 22 24 17 19 10 27 21 12 11 23 16 21]
 [20 19 13 24 12 22 27 17 11 25 10 28 27 21 12 18 22 17 28 28]
 [20 26 16 13 24 26 21 26 22 15 19 25 19 11 20 26 14 10 15 11]
 [15 13 25 16 27 18 21 20 13 23 25 23 21 11 21 17 11 11 11 21]
 [18 28 28 29 25 20 10 18 26 13 15 14 20 26 29 27 14 25 22 19]
 [23 11 28 21 22 19 25 19 17 10 10 12 23 28 14 10 22 15 12 13]
 [29 14 16 22 28 12 27 25 22 25 12 28 18 10 17 10 28 29 17 26]
 [13 23 29 16 15 29 21 25 15 25 17 23 16 12 19 23 18 13 20 17]
 [11 22 15 12 25 28 18 27 13 25 24 10 24 12 14 20 29 14 10 28]] <class 'numpy.ndarray'>

In [67]:
a=np.random.randint(10,30,size=(3,3,3))
print(a,type(a))

[[[11 29 11]
  [27 14 23]
  [14 17 10]]

 [[21 28 24]
  [14 23 28]
  [16 23 24]]

 [[15 17 10]
  [19 14 28]
  [18 20 21]]] <class 'numpy.ndarray'>

In [68]:
a=np.random.randint(10,30,size=(2,2,2,2))
print(a,type(a))

[[[[10 18]
   [22 18]]

  [[28 17]
   [11 12]]]


 [[[22 22]
   [18 26]]

  [[28 28]
   [25 15]]]] <class 'numpy.ndarray'>

In [69]:
# multi dimension array are used in image processing

In [70]:
a=np.random.randint(10,30,dtype=float)
print(a,type(a))

TypeError: Unsupported dtype dtype('float64') for randint

In [ ]:
# rand()---> generating random integer values between 0.0 and 1.0

"""  

"""
# randn()---> generating random integer values between 0.0 and 1.0 (normal distribution)
"""  

"""

'  \n\n'

In [ ]:
a=np.random.uniform(1.5,2.9,size=(2,3,3,3))
print(a,type(a))
print("dimension",a.ndim)
print("shape",a.shape)
print("size",a.size)
print("dtype",a.dtype)

[[[[2.08851978 2.66759212 1.86344694]
   [2.22547847 1.59337147 2.28022215]
   [2.42596536 2.73153228 2.71123368]]

  [[1.76871019 2.77794028 2.73464789]
   [2.86490528 1.55705042 2.11778691]
   [2.63163652 2.25165703 1.69511772]]

  [[2.07223973 2.05762932 2.21650431]
   [2.77046553 2.19935115 2.26308615]
   [2.76217697 2.35458837 1.66862355]]]


 [[[2.72158641 2.09978997 2.30443615]
   [2.44682336 1.9924728  1.58111492]
   [2.3334867  2.32077649 2.14452618]]

  [[2.79808995 1.88832343 2.0536822 ]
   [2.45071752 1.8209472  2.31531861]
   [2.46999475 1.88395301 1.95614113]]

  [[1.65071917 2.0504026  1.58282654]
   [2.37617944 2.50885632 1.54609237]
   [2.46516692 2.4730309  2.72038159]]]] <class 'numpy.ndarray'>
dimension 4
shape (2, 3, 3, 3)
size 54
dtype float64

In [ ]:
import numpy as np
a=np.random.randint(1,101,size=(5,6))
print(a,type(a))

[[ 90  22  52  36   9  71]
 [ 48  54  96 100  43  59]
 [ 65  26  77  89  21  58]
 [ 32  84  87  81  44  73]
 [ 31  31  56  41   2  76]] <class 'numpy.ndarray'>

In [ ]:
np.random.shuffle(a)
print(a)

[[ 31  31  56  41   2  76]
 [ 32  84  87  81  44  73]
 [ 90  22  52  36   9  71]
 [ 48  54  96 100  43  59]
 [ 65  26  77  89  21  58]]

In [ ]:
a=np.arange(0,16).reshape(4,4)
print(a)

[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]
 [12 13 14 15]]

In [ ]:
a=np.arange(0,16).reshape(2,2,2,2)
print(a)

[[[[ 0  1]
   [ 2  3]]

  [[ 4  5]
   [ 6  7]]]


 [[[ 8  9]
   [10 11]]

  [[12 13]
   [14 15]]]]

In [ ]:
help(np.hstack)

Help on _ArrayFunctionDispatcher in module numpy:

hstack(tup, *, dtype=None, casting='same_kind')
    Stack arrays in sequence horizontally (column wise).

    This is equivalent to concatenation along the second axis, except for 1-D
    arrays where it concatenates along the first axis. Rebuilds arrays divided
    by `hsplit`.

    This function makes most sense for arrays with up to 3 dimensions. For
    instance, for pixel-data with a height (first axis), width (second axis),
    and r/g/b channels (third axis). The functions `concatenate`, `stack` and
    `block` provide more general stacking and concatenation operations.

    Parameters
    ----------
    tup : sequence of ndarrays
        The arrays must have the same shape along all but the second axis,
        except 1-D arrays which can be any length. In the case of a single
        array_like input, it will be treated as a sequence of arrays; i.e.,
        each element along the zeroth axis is treated as a separate array.

    dtype : str or dtype
        If provided, the destination array will have this dtype. Cannot be
        provided together with `out`.

        .. versionadded:: 1.24

    casting : {'no', 'equiv', 'safe', 'same_kind', 'unsafe'}, optional
        Controls what kind of data casting may occur. Defaults to 'same_kind'.

        .. versionadded:: 1.24

    Returns
    -------
    stacked : ndarray
        The array formed by stacking the given arrays.

    See Also
    --------
    concatenate : Join a sequence of arrays along an existing axis.
    stack : Join a sequence of arrays along a new axis.
    block : Assemble an nd-array from nested lists of blocks.
    vstack : Stack arrays in sequence vertically (row wise).
    dstack : Stack arrays in sequence depth wise (along third axis).
    column_stack : Stack 1-D arrays as columns into a 2-D array.
    hsplit : Split an array into multiple sub-arrays
             horizontally (column-wise).
    unstack : Split an array into a tuple of sub-arrays along an axis.

    Examples
    --------
    >>> import numpy as np
    >>> a = np.array((1,2,3))
    >>> b = np.array((4,5,6))
    >>> np.hstack((a,b))
    array([1, 2, 3, 4, 5, 6])
    >>> a = np.array([[1],[2],[3]])
    >>> b = np.array([[4],[5],[6]])
    >>> np.hstack((a,b))
    array([[1, 4],
           [2, 5],
           [3, 6]])

In [ ]:
a=np.arange(13)
b=np.array_split(a,4)
print(b)

[array([0, 1, 2, 3]), array([4, 5, 6]), array([7, 8, 9]), array([10, 11, 12])]

In [ ]:
# 0:4 => 0 to 4-1
# 4:5 => 4 to 5-1

# NumPy index
- indexing is the process of obtaining single value from given iterable object.
- the values of iterable object contain +ve index and -ve index
- object of ndarray is also one of the iterable objects. also contain +ve and -ve index.
- in numpy  programmning , we can apply indexing operation on 3 types of array , they are :-
    - 1-D indexing
    - 2-D indexing
    - N-D indexing
________________________________________

# 1-D indexing
- syntax:-
    - 1darray[index]

    - here inding can be +ve  or -ve
    - if we enter valid index then we get corrosponding value from 1d array
    - if we enter invalid index then we get an IndexError.

In [ ]:
# example on indexing operation
import numpy as np

In [ ]:
a=np.array([10,20,30,40,50,60])
print("1.",a[3])
print("2.",a[-1])
print("3.",a[-6])
print("4.",a[len(a)-1])
print("5.",a[-len(a)])
print("6.",a[100])

1. 40
2. 60
3. 10
4. 60
5. 10

IndexError: index 100 is out of bounds for axis 0 with size 6

In [ ]:
print("content of a=",a)
print("Dimension =",a.ndim)
print("shape=",a.shape)
print("size=",a.size)

content of a= [10 20 30 40 50 60]
Dimension = 1
shape= (6,)
size= 6

In [ ]:
print("item size  of a=",a.itemsize)

item size  of a= 8

# 2D Indexing
- syntax:-
    - 2darray[row_index][col_index] 
    - or 
    - 2darray[row_index,col_index]

In [ ]:
a=np.arange(16).reshape(4,4)
print(a,type(a))

[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]
 [12 13 14 15]] <class 'numpy.ndarray'>

In [ ]:
# to get 5
a[1,1]

np.int64(5)

In [ ]:
# to get 5
a[1][1]

np.int64(5)

In [ ]:
# you can get via -ve indexing
a[-3,-3]

np.int64(5)

In [ ]:
# to get 10
a[-2,-2]

np.int64(10)

# 3D indexing
$ or $
# ND indexing

- Syntax:-
    - ndarrayObject[matrixIndex,RowIndex,ColIndex]
    - ndarrayObject[matrixIndex],[rowIndex][colIndex]

In [ ]:
a=np.arange(27).reshape(3,3,3)
print(a,type(a))

[[[ 0  1  2]
  [ 3  4  5]
  [ 6  7  8]]

 [[ 9 10 11]
  [12 13 14]
  [15 16 17]]

 [[18 19 20]
  [21 22 23]
  [24 25 26]]] <class 'numpy.ndarray'>

In [ ]:
print("content of a=",a)
print("Dimension =",a.ndim)
print("shape=",a.shape)
print("size=",a.size)

content of a= [[[ 0  1  2]
  [ 3  4  5]
  [ 6  7  8]]

 [[ 9 10 11]
  [12 13 14]
  [15 16 17]]

 [[18 19 20]
  [21 22 23]
  [24 25 26]]]
Dimension = 3
shape= (3, 3, 3)
size= 27

In [ ]:
# to get 4
a[0,1,1]

np.int64(4)

In [ ]:
#to get 4
a[-3,-2,-2]

np.int64(4)

In [ ]:
#to get 4
a[-3][-2][-2]

np.int64(4)

# Slicing:-
- 1D
- 2D
- 3D OR ND

In [ ]:
a= np.array("mississippi")
print("content of a=",a)
print("Dimension =",a.ndim)
print("shape=",a.shape)
print("size=",a.size)

content of a= mississippi
Dimension = 0
shape= ()
size= 1

In [ ]:
a= np.array(["mississippi"])
print("content of a=",a)
print("Dimension =",a.ndim)
print("shape=",a.shape)
print("size=",a.size)

content of a= ['mississippi']
Dimension = 1
shape= (1,)
size= 1

In [ ]:
a= np.array(list("mississippi"))
print("content of a=",a)
print("Dimension =",a.ndim)
print("shape=",a.shape)
print("size=",a.size)

content of a= ['m' 'i' 's' 's' 'i' 's' 's' 'i' 'p' 'p' 'i']
Dimension = 1
shape= (11,)
size= 11

- the process of obtaining range of values or sub values from an iterable object is called slicing.
- we can apply slicing operations on 3 type of ndarray. they are 
    - 1-D array
    - 2-D array
    - 3-D array /ND array

# 1D array:-
- syntax:- ndarray[begin:end]
    - gives range of values from the begin index to end-1 index provided begin<end
    - syntax:- adarray[begin:]
    - syntax:- adarray[:end]
    - syntax:- adarray[:]
    - syntax:- adarray[begin:end:step]

# syntax for 2D slicing:-
- 2DArrayObj[rowbegin:rowend:rowstep,colbegin:colend,colStep[]]

In [ ]:
import numpy as np
a=np.arange(16).reshape(4,4)
print(a,type(a))

[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]
 [12 13 14 15]] <class 'numpy.ndarray'>

In [ ]:
a[0:4,0:1]

array([[ 0],
       [ 4],
       [ 8],
       [12]])

In [ ]:
a[:,0:1]

array([[ 0],
       [ 4],
       [ 8],
       [12]])

In [ ]:
a[::,:1]

array([[ 0],
       [ 4],
       [ 8],
       [12]])

In [ ]:
# want 4,5,8,9
a[1:3,0:2]

array([[4, 5],
       [8, 9]])

In [ ]:
a[1:4,1:4]

array([[ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15]])

In [ ]:
a[1:3,0:4]

array([[ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [ ]:
a[1:3,:]

array([[ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [ ]:
a[1:3,::]

array([[ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [ ]:
# with step value
a[0:4:2,0:4]

array([[ 0,  1,  2,  3],
       [ 8,  9, 10, 11]])

In [ ]:
a[-2:,-2:]

array([[10, 11],
       [14, 15]])

In [ ]:
# its not possible t get principle element by using regular indexing and slicing operations
# you can get diagonal element via advance indexing method.

In [ ]:
a=np.arange(27).reshape(3,3,3)
print(a)

[[[ 0  1  2]
  [ 3  4  5]
  [ 6  7  8]]

 [[ 9 10 11]
  [12 13 14]
  [15 16 17]]

 [[18 19 20]
  [21 22 23]
  [24 25 26]]]

In [ ]:
"""3D array"""
# [matrixBegin:matrixEnd:matrixStep,rowBegin:rowEnd:rowStep,colBegin:colEnd:colStep]

'3D array'

In [ ]:
a[0:2,0:1,0:2]

array([[[ 0,  1]],

       [[ 9, 10]]])

In [ ]:
a[:2,:1,:2]

array([[[ 0,  1]],

       [[ 9, 10]]])

In [ ]:
a[:,::2,0:1]

array([[[ 0],
        [ 6]],

       [[ 9],
        [15]],

       [[18],
        [24]]])

In [ ]:
a[::2,2:3,::2]

array([[[ 6,  8]],

       [[24, 26]]])

In [ ]:
# want corner element
a[:,::2,::2]

array([[[ 0,  2],
        [ 6,  8]],

       [[ 9, 11],
        [15, 17]],

       [[18, 20],
        [24, 26]]])

In [ ]:
# to convert 3d to 1d
# use ravel and flaten

In [ ]:
"""with slicing operation , we cant get random element 
- for getting random element , we must learn advance indexing and slicing.

"""

'with slicing operation , we cant get random element \n- for getting random element , we must learn advance indexing and slicing.\n\n'

# Advance indexing and slicing
- 2D advance indexing:-
identify the row indices of random element
- syntax : rowindices=(row1,row2,row3..row-n)
- identify the column indices of random element
- syntax : columnindices=(col1,col2,col3..col-n)

- pass the row indices and colindices to original

In [ ]:
import numpy as np
a=np.array([10,20,30,40,50,60,70,80,90])
a.shape=(3,3)
print(a,type(a))

[[10 20 30]
 [40 50 60]
 [70 80 90]] <class 'numpy.ndarray'>

In [ ]:
# to get diagonal element (10,50,90)
rowindices=(0,1,2)# step1
colindices=(0,1,2)#step2
# a[rowindices,colindices]

array([10, 50, 90])

In [ ]:
#get reverse diagonal element
print(a)
a[(0,1,2),(2,1,0)]

[[10 20 30]
 [40 50 60]
 [70 80 90]]

array([30, 50, 70])

In [ ]:
print(a)
a[(0,1,2,2)(1,1,2,0)] # internally process as a[(0,1),(1,1),(2,2),(2,0)]

[[10 20 30]
 [40 50 60]
 [70 80 90]]

<>:2: SyntaxWarning: 'tuple' object is not callable; perhaps you missed a comma?
<>:2: SyntaxWarning: 'tuple' object is not callable; perhaps you missed a comma?
C:\Users\deepa\AppData\Local\Temp\ipykernel_16452\1474923528.py:2: SyntaxWarning: 'tuple' object is not callable; perhaps you missed a comma?
  a[(0,1,2,2)(1,1,2,0)] # internally process as a[(0,1),(1,1),(2,2),(2,0)]

TypeError: 'tuple' object is not callable

# Numpy filtering the data
- 1D,2D,3D or conditional based retrieval from 1D,2D,3D

In [ ]:
import numpy as np
a=np.array([[10,20,30],[40,50,60],[70,80,90]])
print(a)

[[10 20 30]
 [40 50 60]
 [70 80 90]]

In [ ]:
a.shape=(9,)
print(a)

[10 20 30 40 50 60 70 80 90]

In [ ]:

""" 
- procedure-1:-
step1:
create a boolean array
_____________________
step2:-
pass boolean to ndarray
__________

"""

' \n- procedure-1:-\nstep1:\ncreate a boolean array\n_____________________\nstep2:-\npass boolean to ndarray\n__________\n\n'

In [ ]:
# get the multiple of 3
ba=a%3==0
print(ba,type(ba))

[False False  True False False  True False False  True] <class 'numpy.ndarray'>

In [ ]:
# pass the boolean to ndarray object
a[ba]

array([30, 60, 90])

In [ ]:
# get the multiple of 4
a[a%4==0]

array([20, 40, 60, 80])

In [ ]:
a=np.array([[10,-20,-30],[40,-50,60],[70,-80,-90]])
print(a,type(a))

[[ 10 -20 -30]
 [ 40 -50  60]
 [ 70 -80 -90]] <class 'numpy.ndarray'>

In [ ]:
#get all positive value
pa=a[a>0]
print(pa,type(pa))

[10 40 60 70] <class 'numpy.ndarray'>

In [ ]:
#get all the negative value
na=a[a<0]
print(na,type(na))

[-20 -30 -50 -80 -90] <class 'numpy.ndarray'>

# numpy copy vs view
- copy()
- view()

In [ ]:
a=np.array([10,20,30,40])
print(a,type(a))

[10 20 30 40] <class 'numpy.ndarray'>

In [ ]:
b=a.copy()
print("original array = {} and {}".format(a,type(a)))
print("copied array = {} and {}".format(b,type(b)))

original array = [10 20 30 40] and <class 'numpy.ndarray'>
copied array = [10 20 30 40] and <class 'numpy.ndarray'>

In [ ]:
a[0]=100
print("original array = {} and {}".format(a,type(a)))
print("copied array = {} and {}".format(b,type(b)))

original array = [100  20  30  40] and <class 'numpy.ndarray'>
copied array = [10 20 30 40] and <class 'numpy.ndarray'>

# view()

In [ ]:
b=a.view()
print("original array = {} and {}".format(a,type(a)))
print("copied array = {} and {}".format(b,type(b)))

original array = [100  20  30  40] and <class 'numpy.ndarray'>
copied array = [100  20  30  40] and <class 'numpy.ndarray'>

In [ ]:
# it is just deep copy changes on one will affect the others

In [ ]:
# arithmetic operation on ndarray
#or
#arithmetic operation
"""   
+
-
*
/
//
%
**

 """

'   \n+\n-\n*\n/\n//\n%\n**\n\n '

In [ ]:
import numpy as np
help(np.ones)

Help on function ones in module numpy:

ones(shape, dtype=None, order='C', *, device=None, like=None)
    Return a new array of given shape and type, filled with ones.

    Parameters
    ----------
    shape : int or sequence of ints
        Shape of the new array, e.g., ``(2, 3)`` or ``2``.
    dtype : data-type, optional
        The desired data-type for the array, e.g., `numpy.int8`.  Default is
        `numpy.float64`.
    order : {'C', 'F'}, optional, default: C
        Whether to store multi-dimensional data in row-major
        (C-style) or column-major (Fortran-style) order in
        memory.
    device : str, optional
        The device on which to place the created array. Default: None.
        For Array-API interoperability only, so must be ``"cpu"`` if passed.

        .. versionadded:: 2.0.0
    like : array_like, optional
            Reference object to allow the creation of arrays which are not
            NumPy arrays. If an array-like passed in as ``like`` supports
            the ``__array_function__`` protocol, the result will be defined
            by it. In this case, it ensures the creation of an array object
            compatible with that passed in via this argument.

        .. versionadded:: 1.20.0

    Returns
    -------
    out : ndarray
        Array of ones with the given shape, dtype, and order.

    See Also
    --------
    ones_like : Return an array of ones with shape and type of input.
    empty : Return a new uninitialized array.
    zeros : Return a new array setting values to zero.
    full : Return a new array of given shape filled with value.

    Examples
    --------
    >>> import numpy as np
    >>> np.ones(5)
    array([1., 1., 1., 1., 1.])

    >>> np.ones((5,), dtype=int)
    array([1, 1, 1, 1, 1])

    >>> np.ones((2, 1))
    array([[1.],
           [1.]])

    >>> s = (2,2)
    >>> np.ones(s)
    array([[1.,  1.],
           [1.,  1.]])

In [ ]:
import numpy as np
a=np.array([[10,20],[30,40]])
b=np.array([[1,2],[3,4]])
c=np.power(a,b)
print(c)

[[     10     400]
 [  27000 2560000]]

In [ ]:
# another method
d=a**b
print(d)

[[     10     400]
 [  27000 2560000]]

In [ ]:
e=a/b
print(e)

[[10. 10.]
 [10. 10.]]

In [ ]:
a=np.array([[10,20],[30,40]])
b=np.array([[0,1],[2,3]])
c=a/b
print(c)

[[        inf 20.        ]
 [15.         13.33333333]]

C:\Users\deepa\AppData\Local\Temp\ipykernel_3844\1946158853.py:3: RuntimeWarning: divide by zero encountered in divide
  c=a/b

In [ ]:
#inf20  mean infinity 
# how to deal with  it

In [ ]:
c[0,0]

np.float64(inf)

In [ ]:
c[0,0]="can't divide by zero"

ValueError: could not convert string to float: "can't divide by zero"

In [ ]:
d=c.astype(str)
print(d)

[['inf' '20.0']
 ['15.0' '13.333333333333334']]

In [ ]:
d[0,0]="can't divide by zero"
print(d)

[["can't divide by zero" '20.0']
 ['15.0' '13.333333333333334']]

In [ ]:
e=d.astype(object)
print(e)

[["can't divide by zero" '20.0']
 ['15.0' '13.333333333333334']]

In [ ]:
e.dtype

dtype('O')

# where

In [ ]:
a=np.array([10,20,30,10,40,10,20,30])
b=np.where(a==10)
print(b)

(array([0, 3, 5]),)

In [ ]:
s="mississippi"
a=np.array(list(s))
print(a)

['m' 'i' 's' 's' 'i' 's' 's' 'i' 'p' 'p' 'i']

In [ ]:
np.where(a=="s")

(array([2, 3, 5, 6]),)

In [ ]:
a=np.array([[1,2,3],[4,5,6],[7,8,9]])
print(a)

[[1 2 3]
 [4 5 6]
 [7 8 9]]

In [ ]:
ind=np.where(a==4)
print(ind)

(array([1]), array([0]))

In [ ]:
ind=np.where(a%3==0)
print(ind)

(array([0, 1, 2]), array([2, 2, 2]))

In [ ]:
# find the element which are not multiple of 3

# NumPy iteration
- 1D
- 2D
- 3D

- nditer()
- ndenumerate()

In [ ]:
import numpy as np
a = np.array([10,20,30,40,50,60,70,80])
print(a,type(a),id(a))

[10 20 30 40 50 60 70 80] <class 'numpy.ndarray'> 1621729332848

In [ ]:
# display the element of ndarrray using for loop
for val in a:
    print(val)

10
20
30
40
50
60
70
80

In [ ]:
# display the element of ndarray by using while loop
i=0
while(i<len(a)):
    print(a[i])
    i=i+1

10
20
30
40
50
60
70
80

In [ ]:
a=np.arange(16).reshape(4,4)
print("content of a\n",a)
print("dimension",a.ndim)
print("shape",a.shape)

content of a
 [[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]
 [12 13 14 15]]
dimension 2
shape (4, 4)

In [ ]:
for i in a:
    print(i)

[0 1 2 3]
[4 5 6 7]
[ 8  9 10 11]
[12 13 14 15]

In [ ]:
for row in a:
    for colelement in row:
        print(colelement)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15

In [ ]:
a=np.arange(16).reshape(2,4,2)
print("content of a\n",a)
print("dimension",a.ndim)
print("shape",a.shape)

content of a
 [[[ 0  1]
  [ 2  3]
  [ 4  5]
  [ 6  7]]

 [[ 8  9]
  [10 11]
  [12 13]
  [14 15]]]
dimension 3
shape (2, 4, 2)

In [ ]:
for matrix in a:
    for row in matrix:
        for colemement in row:
            print(colemement)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15

- In numpy we have 2 function to iterate the element of ndarray
1. nditer()
2. ndenumerate()

In [ ]:
# nditer()
import numpy as np
a = np.array([10,20,30,40,50,60,70,80,90])
for val in np.nditer(a):
    print(val)

10
20
30
40
50
60
70
80
90

In [ ]:
a.shape=(3,3)
print(a)

[[10 20 30]
 [40 50 60]
 [70 80 90]]

In [ ]:
# displaying 2d
for val in np.nditer(a):
    print(val)

10
20
30
40
50
60
70
80
90

In [ ]:
a=np.array([10,20,30,40,50,60,70,80,90,100,110,120])
a.shape=(2,3,2)
print(a)

[[[ 10  20]
  [ 30  40]
  [ 50  60]]

 [[ 70  80]
  [ 90 100]
  [110 120]]]

In [ ]:
# diplay 3d
for val in np.nditer(a):
     print(val)

10
20
30
40
50
60
70
80
90
100
110
120

In [ ]:
# using ndenumerate
for index,value in np.ndenumerate(a):
    print(index,"-->",value)

(0, 0, 0) --> 10
(0, 0, 1) --> 20
(0, 1, 0) --> 30
(0, 1, 1) --> 40
(0, 2, 0) --> 50
(0, 2, 1) --> 60
(1, 0, 0) --> 70
(1, 0, 1) --> 80
(1, 1, 0) --> 90
(1, 1, 1) --> 100
(1, 2, 0) --> 110
(1, 2, 1) --> 120

In [ ]:
# index start with 0 but you want to start it with 1
a = np.array([10,20,30,40,50,60,70,80,90])
for i,v in np.ndenumerate(a):
    print("{}-->{}".format(i[0]+1,v))

1-->10
2-->20
3-->30
4-->40
5-->50
6-->60
7-->70
8-->80
9-->90

In [ ]:
# the above is called program define index

In [ ]:
"""  
=> random.rand()
=> random.uniform()- uniform distribution
=> random.randn()
=> random.normal()-normal distribution

_______________________

# data distribution in numpy
- possibility of occurence of value
- value of occurence in list.

_____________________

probability 
"""

'  \n=> random.rand()\n=> random.uniform()- uniform distribution\n=> random.randn()\n=> random.normal()-normal distribution\n\n_______________________\n\n# data distribution in numpy\n- possibility of occurence of value\n- value of occurence in list.\n\n_____________________\n\nprobability \n'

In [ ]:
# numpy random data distribution
a=np.array([3,5,7,9])
x=np.random.choice(a,p=[0.1,0.3,0.6,0.0],size=(100))
print(x)

[5 7 7 5 5 7 7 7 7 7 3 7 7 5 3 7 5 5 7 7 7 3 7 5 7 3 7 7 7 7 7 3 7 5 7 7 7
 7 7 7 5 5 7 7 5 7 7 5 5 7 3 7 7 7 7 7 5 7 7 7 5 7 5 7 7 7 7 7 7 7 5 5 5 5
 7 7 7 7 5 5 5 7 7 5 5 5 3 3 7 7 7 7 5 5 7 7 5 5 3 7]

In [ ]:
print(x.size)

100

In [ ]:
import random as r
lst=[10,20,30,40,50,60]
r.shuffle(lst)
print(lst)

[10, 40, 20, 60, 50, 30]

In [ ]:
for i in range(len(lst)):
    r.shuffle(lst)
    print(lst)

[20, 30, 10, 60, 50, 40]
[20, 60, 40, 10, 50, 30]
[60, 50, 10, 20, 30, 40]
[60, 10, 40, 30, 50, 20]
[10, 40, 60, 50, 20, 30]
[40, 10, 60, 30, 20, 50]

In [ ]:
s="mississippi"
""" 
shuffle cannot apply on str,byte ,tuple,range,set,frozenset ,dict ,since they are immutable in nature
"""

' \nshuffle cannot apply on str,byte ,tuple,range,set,frozenset ,dict ,since they are immutable in nature\n'

In [ ]:
s="mississippi"
lst=list(s)
for i in range(len(lst)):
    r.shuffle(lst)
    print(''.join(lst))

sismpiissip
sissimiipsp
pissmpsisii
iipssiimpss
piiimspsssi
piismsipsis
ipssmispsii
ipsiiispssm
imisipspsis
iispspimssi
mpipsssiiis

In [ ]:
# example on numpy permutation and combination by numpy.random.shuffle and permutation .

# NumPy random permutation of elements
- a permutation refer to an arrangement of element eg: [3,2,1] is a permuataion of [1,2,3] and vice versa 
- NumPy random module provide two method for this 
1. shuffle() and
2. permutation()

In [ ]:
a=np.array([10,20,30,40,50,])
print("original ndarray object=",a)

original ndarray object= [10 20 30 40 50]

In [ ]:
# re-arrange the elements of ndarray
np.random.shuffle(a)
print(a)

[40 30 20 10 50]

In [ ]:
for i in range(len(a)):
    np.random.shuffle(a)
    print(a)

[20 30 10 40 50]
[30 50 20 40 10]
[10 20 40 50 30]
[50 40 30 20 10]
[40 20 10 50 30]

# generating permutation of array
- the permutation method return a re-arranged array (leaves the original array unchanged)

In [ ]:
# by using permutation  for re-arranging elements
arr=np.array([1,2,3,4,5])
print(np.random.permutation(arr))

[1 3 5 2 4]

In [ ]:
arr=np.array(list("mississippi"))
x=np.random.permutation(arr)
print(x)

['s' 'm' 'i' 's' 'i' 'i' 's' 'p' 'p' 'i' 's']

In [ ]:
arr=np.array(list("mississippi"))
for i in range(len(arr)):
    x=np.random.permutation(arr)
    print(x)

['p' 'i' 'p' 'i' 's' 's' 'i' 's' 'm' 's' 'i']
['i' 's' 'p' 'i' 'i' 's' 's' 'p' 's' 'm' 'i']
['i' 'i' 's' 'm' 'p' 's' 's' 'i' 's' 'p' 'i']
['p' 's' 'p' 'i' 's' 'i' 's' 's' 'm' 'i' 'i']
['s' 'p' 's' 'i' 'i' 'i' 'p' 's' 'm' 's' 'i']
['i' 'm' 's' 'i' 'p' 's' 's' 's' 'p' 'i' 'i']
['s' 'i' 'i' 'p' 's' 's' 's' 'i' 'i' 'm' 'p']
['i' 's' 'i' 'p' 's' 'i' 'i' 'm' 's' 's' 'p']
['s' 'i' 's' 's' 'i' 'i' 's' 'i' 'p' 'p' 'm']
['i' 'm' 's' 's' 'p' 'i' 'i' 's' 'p' 's' 'i']
['s' 's' 'i' 'i' 'm' 'p' 'i' 's' 'i' 'p' 's']

In [ ]:
print("".join(x))

ssiimpisips

# flatten() and ravel()

In [ ]:
a=np.arange(9).reshape(3,3)
print(a)
print("dimension=",a.ndim)
print("shape=",a.shape)

[[0 1 2]
 [3 4 5]
 [6 7 8]]
dimension= 2
shape= (3, 3)

In [ ]:
# now make it flatten 
a.shape=(9,)
print(a)

[0 1 2 3 4 5 6 7 8]

In [ ]:
a=np.arange(9).reshape(3,3)
print(a.flatten())
print("dimension=",a.ndim)
print("shape=",a.shape)

[0 1 2 3 4 5 6 7 8]
dimension= 2
shape= (3, 3)

In [ ]:
""" 
-->numpy is made from "C" and "FORTRAN"
--> "C"- stand for column measure 
--> "FORTAN" - stand for formula translation 
"""

' \n-->numpy is made from "C" and "FORTRAN"\n--> "C"- stand for column measure \n--> "FORTAN" - stand for formula translation \n'

In [ ]:
a=np.arange(9).reshape(3,3)
print("given array")
print(a)
print("-------------------------------")
x=a.flatten("F")
print("content of x=",x)
print("dimension=",x.ndim)
print("shape=",x.shape)

given array
[[0 1 2]
 [3 4 5]
 [6 7 8]]
-------------------------------
content of x= [0 3 6 1 4 7 2 5 8]
dimension= 1
shape= (9,)

In [ ]:
# column become row
# row become column

In [ ]:
a=np.arange(9).reshape(3,3)
print("given array")
print(a.ravel())

given array
[0 1 2 3 4 5 6 7 8]

In [ ]:
# example of numpy swaping

In [ ]:
import numpy as np
# create array with shape(4,3)
my_array=np.arange(12).reshape(4,3)
print("original array:")
print(my_array)
# swaping the column with index of original array
my_array[:,[2,0]]=my_array[:,[0,2]]
print("after swaping the array the last column and first column :")
print(my_array)

original array:
[[ 0  1  2]
 [ 3  4  5]
 [ 6  7  8]
 [ 9 10 11]]
after swaping the array the last column and first column :
[[ 2  1  0]
 [ 5  4  3]
 [ 8  7  6]
 [11 10  9]]

In [ ]:
# function defination for swap

""" 
import numpy as np
# creating array
def swap(arr,startIndex,lastIndex):
     arr[:,[startIndex,lastIndex]]=arr[lastIndex,startIndex]
   
"""

' \nimport numpy as np\n# creating array\ndef swap(arr,startIndex,lastIndex):\n     arr[:,[startIndex,lastIndex]]=arr[lastIndex,startIndex]\n   \n'

# Numpy statistics operation:-
1. amax()
2. amin()
3. mean()
4. median()
5. mode() not present in python module
6. var() # variance 
7. std() # standard deviation

In [ ]:
# 1d array
a=np.array([10,20,3,5,14,-6,26])
print(np.amax(a))
print(np.amin(a))

26
-6

In [ ]:
# 2d array related row max and col max
a=np.array([[1,2,3],[4,5,6],[7,8,9]])
print(a)
print(np.amax(a))
print(np.amin(a))
print(np.amax(a,axis=0))
print(np.amax(a,axis=1))

[[1 2 3]
 [4 5 6]
 [7 8 9]]
9
1
[7 8 9]
[3 6 9]

In [ ]:
# find the mean 
lst=[10,20,30,40,50,60,70,80,90,100]
s=0
for val in lst:
    s=s+val
    
print(":sum=",s)
print("mean or average=",(s/len(lst)))
print("using pre define function:",(sum(lst)/len(lst)))

:sum= 550
mean or average= 55.0
using pre define function: 55.0

In [ ]:
# finding mean of 1D array
a=np.array([10,20,30,40,50,60,70,80,90,100])
print("content of a",a)
print("mean of 1D array",np.mean(a))

content of a [ 10  20  30  40  50  60  70  80  90 100]
mean of 1D array 55.0

In [ ]:
# finding mean of 2D array

a=np.array([[10,20,30],[40,50,60],[70,80,90]])
print(a)
print("mean of 2D array",np.mean(a))
print("mean of 2D array along axis 0",np.mean(a,axis=0))
print("mean of 2D array along axis 1",np.mean(a,axis=1))

[[10 20 30]
 [40 50 60]
 [70 80 90]]
mean of 2D array 50.0
mean of 2D array along axis 0 [40. 50. 60.]
mean of 2D array along axis 1 [20. 50. 80.]

In [ ]:
""" 
0 axis mean = y axis or vertical axis or column
1 axis mean = x axis or horizontal axis or row

"""

' \n0 axis mean = y axis or vertical axis or column\n1 axis mean = x axis or horizontal axis or row\n\n'

In [ ]:
# finding median of 1D array
sals=[12,35,24,6,36,8,9]
asals=np.array(sals)
print("list of average salary",asals)
mdsal=np.median(asals)
print(mdsal)
print("mean sal",np.mean(asals))

list of average salary [12 35 24  6 36  8  9]
12.0
mean sal 18.571428571428573

In [ ]:
# find the median of 2-d array with number of values
import numpy as np
a=np.array([[10,2,20],[5,15,8],[5,15,4]])
print(a)
print("median",np.median(a))
print("median of 2d array",np.mean(a))

[[10  2 20]
 [ 5 15  8]
 [ 5 15  4]]
median 8.0
median of 2d array 9.333333333333334

In [ ]:
# print(np.mode)
# we dont have mode in numpy

# Finding variance

In [ ]:
import numpy as np
a=np.array([[2,4],[1,3]])
print(a,type(a))

[[2 4]
 [1 3]] <class 'numpy.ndarray'>

In [ ]:
# calculating mean
print(np.mean(a))

2.5

In [ ]:
# total variance of a
print("variance of a=",np.var(a))

variance of a= 1.25

In [ ]:
# column variance of a
print("column variance of a=",np.var(a,axis=0))

column variance of a= [0.25 0.25]

In [ ]:
# row variance of a
print("column variance of a=",np.var(a,axis=1))

column variance of a= [1. 1.]

# standard deviation
# standard deviation =math.sqrt(variance)

In [ ]:
# total variance
print(np.std(a))

1.118033988749895

In [ ]:
# colummn variance
print(np.std(a,axis=0))

[0.5 0.5]

In [ ]:
# row variance
print(np.std(a,axis=1))

[1. 1.]

# concept of mode via statistics

In [ ]:
import statistics as s
lst=[10,20,30,10,40,50,20,10,15]
print(s.mode(lst))

10

In [ ]:
# mode give most frequent/occurence element

In [ ]:
# to find multi frequent element 
lst=[10,20,30,10,40,30,50,20,10,15,20,20,10,15,30,30]
print(s.multimode(lst))

[10, 20, 30]

In [ ]:
import numpy as np
a=np.array(list("mississippi"))
print(s.multimode(a))

[np.str_('i'), np.str_('s')]

# ndarray with appending,insert,delete operation

In [ ]:
# append()
a=np.array([10,20,30,40])
print(a,type(a))

[10 20 30 40] <class 'numpy.ndarray'>

In [ ]:
np.append(a,100)

array([ 10,  20,  30,  40, 100])

In [ ]:
# appending multiple values to ndarray object   
a=np.append(a,[50,60,70,80,90,100])
print(a)

[ 10  20  30  40  50  60  70  80  90 100]

In [ ]:
# append function with 2d
a=np.array([[10,20],[30,40]])
print(a)

[[10 20]
 [30 40]]

In [ ]:
a=np.append(a,[[50,60],[70,80]],axis=0)
print(a)

[[10 20]
 [30 40]
 [50 60]
 [70 80]]

In [ ]:
a=np.append(a,[[50,60],[70,80]],axis=0)
print(a)

[[10 20]
 [30 40]
 [50 60]
 [70 80]
 [50 60]
 [70 80]]

In [ ]:
# column
a=np.append(a,[[0,0]],axis=0)
print(a)

[[10 20]
 [30 40]
 [50 60]
 [70 80]
 [50 60]
 [70 80]
 [ 0  0]]

In [ ]:
a=np.append(a,[[0],[0],[1],[1],[0]],axis=1)
print(a)

ValueError: all the input array dimensions except for the concatenation axis must match exactly, but along dimension 0, the array at index 0 has size 7 and the array at index 1 has size 5

# insert operation on ndarray

In [ ]:
a=np.array([10,20,30,40,50,60])
print(a)

[10 20 30 40 50 60]

In [ ]:
print(a,1,15)

[10 20 30 40 50 60] 1 15

In [ ]:
a=np.insert(a,1,15)
print(a)

[10 15 20 30 40 50 60]

In [ ]:
a=np.insert(a,3,[11,22,33,44])
print(a)

[10 15 20 11 22 33 44 30 40 50 60]

In [ ]:
a=np.array([10,20,30,40,50,60,70,80,90])
print(a)

[10 20 30 40 50 60 70 80 90]

In [ ]:
a.shape=(3,3)
print(a)

[[10 20 30]
 [40 50 60]
 [70 80 90]]

In [ ]:
print(np.insert(a,1,[11,22,33],axis=0))

[[10 20 30]
 [11 22 33]
 [40 50 60]
 [70 80 90]]

In [ ]:
print(np.insert(a,1,[44,55,66],axis=1))

[[10 44 20 30]
 [40 55 50 60]
 [70 66 80 90]]

# delete

In [ ]:
print(np.delete(a,[0,-2]))

[20 30 40 50 60 70 90]

In [ ]:
a=np.arange(5*5).reshape(5,5)
print(a)

[[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]
 [20 21 22 23 24]]

In [ ]:
a=np.delete(a,2,axis=0)
print(a)

[[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [15 16 17 18 19]
 [20 21 22 23 24]]

In [ ]:
a=np.arange(5*5).reshape(5,5)
print(a)

[[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]
 [20 21 22 23 24]]

In [ ]:
a=np.delete(a,1,axis=1)
print(a)

[[ 0  2  3  4]
 [ 5  7  8  9]
 [10 12 13 14]
 [15 17 18 19]
 [20 22 23 24]]

In [ ]:
# axis =1 mean column
# axis =0 mean row

In [ ]:
import numpy as np
a=np.arange(25).reshape(5,5)
print(a)

[[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]
 [20 21 22 23 24]]

In [ ]:
import numpy as np
import statistics as s
a=np.arange(25).reshape(5,5)
print(a)

[[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]
 [20 21 22 23 24]]

In [ ]:
# to delete complete array
del a

In [ ]:
print(a)

NameError: name 'a' is not defined

In [ ]:
a=np.arange(5*5).reshape(5,5)
print(a)

[[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]
 [20 21 22 23 24]]

In [ ]:
a=np.delete(a,[int(i) for i in range(a.shape[0])],axis=1)
print(a)

[]

# universal function
- add()
- subtract()
- multiply()
- divide()
- floor_divide()
- mod()
- power()
- remainder()
- divmod() q=[] r=[]

In [ ]:
import numpy as np
arr1=np.array([1,2,3,4,5])
arr2=np.array([6,7,8,9,10])
print(np.multiply(arr1, arr2))
print(np.subtract(arr1, arr2))
print(np.add(arr1, arr2))
print(np.divide(arr1, arr2))

[ 6 14 24 36 50]
[-5 -5 -5 -5 -5]
[ 7  9 11 13 15]
[0.16666667 0.28571429 0.375      0.44444444 0.5       ]

In [ ]:
arr=np.around(3.16666)
print(arr)

3.0

In [ ]:
arr=np.array([3,6,9])
x=np.lcm.reduce(arr)
print(x)

18

In [ ]:
# numpy gcd greatest common denominator
arr=np.array([20,8,32,16])
x=np.gcd.reduce(arr)
print(x)

4

# numpy sorting data

In [ ]:
a=np.array([10,2,13,4,-5,0,16,25,-16])
print(a)
# to sort the data 
print(np.sort(a))

[ 10   2  13   4  -5   0  16  25 -16]
[-16  -5   0   2   4  10  13  16  25]

In [ ]:
a.shape=(3,3)
print(a)

[[ 10   2  13]
 [  4  -5   0]
 [ 16  25 -16]]

In [ ]:
np.sort(a,axis=0)

array([[  4,  -5, -16],
       [ 10,   2,   0],
       [ 16,  25,  13]])

In [ ]:
# here axis=0 represent column , column based sorting

# example of linear algebra
- solve()
- det()
- inv()

In [ ]:
# consider the following linear equation:-
#2x+3y=6 -->1
#6x+4y=3 -->2
# find the value of x and y
a=np.array([[2,3],[6,4]])  
b=np.array([6,3])
sol=np.linalg.solve(a,b)
print(sol)

[-1.5  3. ]

In [ ]:
#x+y+z=6
#2x+3y+9z=16
#2x-4y-9z=20
a=np.array([[1,1,1],[2,3,9],[2,-4,-9]])
b=np.array([6,16,20])
sol=np.linalg.solve(a,b)
print(sol)
print("val of x=",sol[0])
print("val of y=",sol[1])
print("val of z=",sol[2])

[ 8.19354839 -3.22580645  1.03225806]
val of x= 8.193548387096774
val of y= -3.225806451612903
val of z= 1.032258064516129

In [ ]:
# find det of given matrix
a=-np.array([[1,2],[3,4]])
detA=np.linalg.det(a)
print(detA)

-2.0000000000000004

In [ ]:
# find det of given matrix
a=-np.array([[1,2,3],[4,5,6],[7,8,2]])
detA=np.linalg.det(a)
print(detA)

-20.99999999999999

In [ ]:
# inverse of given matrix
a=np.array([[1,2],[3,4]])
invA=np.linalg.inv(a)
print(invA)

[[-2.   1. ]
 [ 1.5 -0.5]]

- develop by wes mc kinney - package/module/
- pip install pandas
- import pandas as pd 
- print(pd.__version___)

- pip show pandas
- pip list
- in pandas data is organise in 1 . series 2. datafrane 3. panel

# Pandas
- why do we need panadas ?
- it is fast , flexible and powerful data mining library , pandas is the most crucial module for applying data science using python 

- *********************
- Advantage of pandas:-
    - easy import and export into tabular formaty data structures like dataframe
    - routing( function and method ) for manipulation
    - easy handling of missing data
    - data set cleaning , merging and joining.
    - reshaping data set .
    column can be inserted ,deleted and updated from dataframe and higher dimension object.
    - time series based data manipulation and analysis API
    - group by functionality to perform split apply combine operation.
    - well integrated with other library  like numpy and and matplotlib.
    - data produce by pandas are often used as data visualisation.

In [ ]:
"""  
  data structure used in pandas:-
  1. series
  2. data frame
  3. panel
"""

'  \n  data structure used in pandas:-\n  1. series\n  2. data frame\n  3. panel\n'

# series
    - it is 1D array , it is capable of storing same type  + diffrent type and all types and internally treated as same type as object.
    - all values in series contain by default indices (row indices {start from 0 to n-1 here n represent number of values})
    - programtically , we can give programmer defined indices for values of series instead of default indices.
    - series object are "mutable" objects.
    - series data can be accessed either w.r.t indices (axis) or  programmer defined indices called (label).
    - on series object we can perform indexing and slicing operations.

******************************
- number of approaches to create an object of series:-
    - varname = pandas.Series(object,index,dtype)

In [ ]:
import pandas as pd
print(pd.__version__)

2.2.3

In [ ]:
# creating an object of series
# syntax varname = pandas.Series(object,index,dtype

In [ ]:
a=100
print(a,type(a))

100 <class 'int'>

In [ ]:
s=pd.Series(a)
print(s,type(s))

0    100
dtype: int64 <class 'pandas.core.series.Series'>

In [ ]:
s=pd.Series(10.15)
print(s,type(s))

0    10.15
dtype: float64 <class 'pandas.core.series.Series'>

In [ ]:
fo=12.34
s=pd.Series(fo)
print(s,type(s))

0    12.34
dtype: float64 <class 'pandas.core.series.Series'>

In [ ]:
fo=False
s=pd.Series(fo)
print(s,type(s))

0    False
dtype: bool <class 'pandas.core.series.Series'>

In [ ]:
fo=12.34+5j
s=pd.Series(fo)
print(s,type(s))

0    12.34+ 5.00j
dtype: complex128 <class 'pandas.core.series.Series'>

In [ ]:
a=100
s=pd.Series(a,dtype=float)
print(s,type(s))

0    100.0
dtype: float64 <class 'pandas.core.series.Series'>

In [ ]:
s1="python"
s=pd.Series(s1)
print(s,type(s1))

0    python
dtype: object <class 'str'>

In [ ]:
# creating a series object by using range
r=range(6)
s=pd.Series(r)
print(s,type(s))

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64 <class 'pandas.core.series.Series'>

In [ ]:
# creating a series object by using range with default indices
r=range(6)
s=pd.Series(r,index=[1,2,3,4,5,6])
print(s,type(s))

1    0
2    1
3    2
4    3
5    4
6    5
dtype: int64 <class 'pandas.core.series.Series'>

In [ ]:
# creating a series object by using range with default indices
r=range(6)
s=pd.Series(r,index=["id1", "id2", "id3", "id4","id5","id6"])
print(s,type(s))

id1    0
id2    1
id3    2
id4    3
id5    4
id6    5
dtype: int64 <class 'pandas.core.series.Series'>

In [ ]:
s["id1"]

np.int64(0)

In [ ]:
s["id5"]

np.int64(4)

In [ ]:
# keyerror - because no default indices present when we give programmer defined int indices.

In [ ]:
# creating a series of object by using list/tuple with default indices
lst=[10,20,30,40,50,60]
s=pd.Series(lst)
print(s,type(s))

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64 <class 'pandas.core.series.Series'>

In [ ]:
# creating a series of object by using list/tuple with default indices
lst=[10,20,30,40,50,60]
s=pd.Series(lst,index=[1,2,3,4,5,6],dtype=float)
print(s,type(s))

1    10.0
2    20.0
3    30.0
4    40.0
5    50.0
6    60.0
dtype: float64 <class 'pandas.core.series.Series'>

In [ ]:
# creating a series of object by using list/tuple with default indices
lst=[10,20,30,40,50,60]
s=pd.Series(lst,index=[int(x) for x in range(1,7)],dtype=float)
print(s,type(s))

1    10.0
2    20.0
3    30.0
4    40.0
5    50.0
6    60.0
dtype: float64 <class 'pandas.core.series.Series'>

In [ ]:
# creating a series of object by using list/tuple with default indices
lst=[10,20,30,40,50,60]
s=pd.Series(lst,index=["id" + str(int(x)) for x in range(1,7)],dtype=float)
print(s,type(s))

id1    10.0
id2    20.0
id3    30.0
id4    40.0
id5    50.0
id6    60.0
dtype: float64 <class 'pandas.core.series.Series'>

In [ ]:
# creating a series of object by using list/tuple with default indices
tpl=(10,20,30,40,50,60)
s=pd.Series(lst,index=["id" + str(int(x)) for x in range(1,7)],dtype=float)
print(s,type(s))

id1    10.0
id2    20.0
id3    30.0
id4    40.0
id5    50.0
id6    60.0
dtype: float64 <class 'pandas.core.series.Series'>

In [ ]:
# creating a series of object by using set with default indices
# set does not maintain insertion order
s1={10,20,30,40,50,60}
print(s1,type(s1))

{50, 20, 40, 10, 60, 30} <class 'set'>

In [ ]:
# creating a series of object by using set with default indices
# set does not maintain insertion order
s1={10,20,30,40,50,60}
print(s1,type(s1))
print(50*"*")
s=pd.Series(s1)
print(s,type(s))

{50, 20, 40, 10, 60, 30} <class 'set'>
**************************************************

TypeError: 'set' type is unordered

In [ ]:
# in pandas set is not possible if you want then convert it into list/tuple

In [ ]:
# creating a series of object by using dict  
d1={10:"python",20:"django",30:"ml",40:"dl"}
print(d1,type(d1))

{10: 'python', 20: 'django', 30: 'ml', 40: 'dl'} <class 'dict'>

In [ ]:
s=pd.Series(d1)
print(s,type(s))

10    python
20    django
30        ml
40        dl
dtype: object <class 'pandas.core.series.Series'>

In [ ]:
s[10]

'python'

In [ ]:
s[20]

'django'

In [ ]:
s[10:30]

Series([], dtype: object)

In [ ]:
#empty series is created

In [ ]:
d={"crs1":["python","django","data science"],"crs2":["java","hibernet","spring"]}

In [ ]:
for key,value in d.items():
    print("{}-->{}".format(key,value))

crs1-->['python', 'django', 'data science']
crs2-->['java', 'hibernet', 'spring']

In [ ]:
s=pd.Series(d)
print(s)

crs1    [python, django, data science]
crs2          [java, hibernet, spring]
dtype: object

In [ ]:
s["crs1"]

['python', 'django', 'data science']

In [ ]:
s[1]

C:\Users\deepa\AppData\Local\Temp\ipykernel_11288\878419959.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[1]

['java', 'hibernet', 'spring']

In [ ]:
import numpy as np
a=np.array((100,200,300,400,500))
print(a)
print(20*"-")
s=pd.Series(a)
print(s)

[100 200 300 400 500]
--------------------
0    100
1    200
2    300
3    400
4    500
dtype: int64

In [ ]:
a=np.array((100,200,300,400,500))
print(a)
s=pd.Series(a,index=["id" +str(int(x)) for x in range(1,len(a)+1)],dtype=float)

[100 200 300 400 500]

# set and get data to / from series object

In [ ]:
names= pd.Series(["mark","sundar","musk","rossum","travis"],index=["a","b","c","d","e"])
print(names)

a      mark
b    sundar
c      musk
d    rossum
e    travis
dtype: object

In [ ]:
ser=pd.Series(range(1,20,3),index=[x for x in "abcdefg"])
print(ser)

a     1
b     4
c     7
d    10
e    13
f    16
g    19
dtype: int64

In [ ]:
ser=np.arange(10,15)
serobj=pd.Series(data=ser*5,index=ser)
print(serobj)

10    50
11    55
12    60
13    65
14    70
dtype: int64

In [ ]:
# loc and iloc
# loc --> location
# iloc --> index location
# loc is used to access the data using the index value
# iloc is used to access the data using the index position

In [ ]:
names.iloc[0:4]

a      mark
b    sundar
c      musk
d    rossum
dtype: object

In [ ]:
#syntax:-
#series obj.iloc[begin:end:step]

In [ ]:
names.loc["a":"d"]

a      mark
b    sundar
c      musk
d    rossum
dtype: object

In [ ]:
names.loc[::-1]

e    travis
d    rossum
c      musk
b    sundar
a      mark
dtype: object

In [ ]:
names.iloc["a":"d"]

TypeError: cannot do positional indexing on Index with these indexers [a] of type str

In [ ]:
"""  
loc[]--> default indices are possible+ programmer define indices are also possible

iloc[]--> default indices possible+ programmer define indices are not possible.

"""

'  \nloc[]--> default indices are possible+ programmer define indices are also possible\n\niloc[]--> default indices possible+ programmer define indices are not possible.\n\n'

In [ ]:
names=pd.Series(["mark","rita","vickey","justin","john","michel"])
print(names)

0      mark
1      rita
2    vickey
3    justin
4      john
5    michel
dtype: object

In [ ]:
names[0]="sujata"
print(names)

0    sujata
1      rita
2    vickey
3    justin
4      john
5    michel
dtype: object

In [ ]:
# changed 2 names at once 
names[1:3]=["sangeeta","pragati"]
print(names)

0      sujata
1    sangeeta
2     pragati
3      justin
4        john
5      michel
dtype: object

In [ ]:
names[6]="dori"
print(names)

0      sujata
1    sangeeta
2     pragati
3      justin
4        john
5      michel
6        dori
dtype: object

In [ ]:
names[7]="deep"
print(names)

0      sujata
1    sangeeta
2     pragati
3      justin
4        john
5      michel
6        dori
7        deep
dtype: object

In [ ]:
del names[7]
print(names)

0      sujata
1    sangeeta
2     pragati
3      justin
4        john
5      michel
6        dori
dtype: object

# attribute of Series object
    - name of pandas series object
    - get all values of series as a list
    - get count of number of element in series
    - check if series is empty or not
    - get first n element of pandas series
    - get last n element of pandas series
    - get the count of non NaN value
    --------------------------------
    # add and remove series element
    - adding / merging series together
    - subtracting two series
    - deleting element from series
    - get sum of all values in the series
    - get the max values in the series

In [ ]:
import pandas as pd
names = pd.Series(["dori","itty","dhurvi","geet"],index=["a","b","c","d"])
print(names)

a      dori
b      itty
c    dhurvi
d      geet
dtype: object

In [ ]:
print(names.values)

['dori' 'itty' 'dhurvi' 'geet']

In [ ]:
lst=list(names.values)
print(lst)

['dori', 'itty', 'dhurvi', 'geet']

In [ ]:
# missing number in pandas are represented by NaN

In [ ]:
a=np.array([10,20,None,30,40,True])
print(a)

[10 20 None 30 40 True]

In [ ]:
s=pd.Series(a)
print(s)

0      10
1      20
2    None
3      30
4      40
5    True
dtype: object

In [ ]:
print(s.count())

5

In [ ]:
s1=pd.Series(["dori","itty","dhurvi","geet",10,20,30,False,None],name="students")
print(s1)

0      dori
1      itty
2    dhurvi
3      geet
4        10
5        20
6        30
7     False
8      None
Name: students, dtype: object

In [ ]:
# get the first n element in pandas series --- we use head() of series object.

In [ ]:
import pandas as pd
s1=pd.Series(range(10,100,5))
print(s1)

0     10
1     15
2     20
3     25
4     30
5     35
6     40
7     45
8     50
9     55
10    60
11    65
12    70
13    75
14    80
15    85
16    90
17    95
dtype: int64

In [ ]:
print(s1.head())

0    10
1    15
2    20
3    25
4    30
dtype: int64

In [ ]:
print(len(s1))

38

In [ ]:
#get first three elements in pandas series
print(s1.head(3))

0    10
1    15
2    20
dtype: int64

In [ ]:
# to get last 10 value we use tail() of series object
print(s1.tail())

33    175
34    180
35    185
36    190
37    195
dtype: int64

In [ ]:
print(s1.tail(10))

28    150
29    155
30    160
31    165
32    170
33    175
34    180
35    185
36    190
37    195
dtype: int64

In [ ]:
# another method to get first 5
s1[0:5]

0    10
1    15
2    20
3    25
4    30
dtype: int64

In [ ]:
# another method to get last 5
s1[-5:]

33    175
34    180
35    185
36    190
37    195
dtype: int64

In [ ]:
# add and remove series element
# to add the element of one series object to another we use a function add()

#syntax: varname=serobj1.add(serobj2,fill_value=None)

In [ ]:
# to add a series element
s1=pd.Series([100,200,300,400,500],index=["a","b","c","d","e"])
s2=pd.Series([10,20,30,40],index=["a","b","g","e"])
res=s1.add(s2)
print(res)

a    110.0
b    220.0
c      NaN
d      NaN
e    540.0
g      NaN
dtype: float64

In [ ]:
# fill NaN with other value 
s1=pd.Series([100,200,300,400,500],index=["a","b","c","d","e"])
s2=pd.Series([10,20,30,40],index=["a","b","g","e"])
res=s1.add(s2,fill_value=0)
print(res)

a    110.0
b    220.0
c    300.0
d    400.0
e    540.0
g     30.0
dtype: float64

In [ ]:
# to subtract a series element
s1=pd.Series([100,200,300,400,500],index=["a","b","c","d","e"])
s2=pd.Series([10,20,30,40],index=["a","b","g","e"])
res=s1.subtract(s2)
print(res)

a     90.0
b    180.0
c      NaN
d      NaN
e    460.0
g      NaN
dtype: float64

In [ ]:
# to subtract a series element
s1=pd.Series([100,200,300,400,500],index=["a","b","c","d","e"])
s2=pd.Series([10,20,30,40],index=["a","b","g","e"])
res=s1.subtract(s2,fill_value=0)
print(res)

a     90.0
b    180.0
c    300.0
d    400.0
e    460.0
g    -30.0
dtype: float64

In [ ]:
# to multiply a series element
s1=pd.Series([100,200,300,400,500],index=["a","b","c","d","e"])
s2=pd.Series([10,20,30,40],index=["a","b","g","e"])
res=s1.multiply(s2)
print(res)

a     1000.0
b     4000.0
c        NaN
d        NaN
e    20000.0
g        NaN
dtype: float64

In [ ]:
# to delete c
res=s1.drop("c")
print(res)

a    100
b    200
d    400
e    500
dtype: int64

In [ ]:
print(s1)

a    100
b    200
c    300
d    400
e    500
dtype: int64

In [ ]:
# note s1 is not modified

In [ ]:
# some statistics function for data science:-
""" 
1. sum()
2. count()
3. mean()
4. median()
5. variances()
6. std()
7. max()
8. min()
9. mode()
"""

' \n1. sum()\n2. count()\n3. mean()\n4. median()\n5. variances()\n6. std()\n7. max()\n8. min()\n9. mode()\n'

In [ ]:
s=pd.Series([10,20,13,4,0,12])
print(s)

0    10
1    20
2    13
3     4
4     0
5    12
dtype: int64

In [ ]:
print("sum of elements",s.sum())

sum of elements 59

In [ ]:
import pandas as pd
import numpy as np
s=pd.Series([10,20,13,4,0,12,np.nan,None])
print(s)

0    10.0
1    20.0
2    13.0
3     4.0
4     0.0
5    12.0
6     NaN
7     NaN
dtype: float64

In [ ]:
import pandas as pd
import numpy as np
s=pd.Series([12,34,15,8,22,10,8,-4])
print(s)

0    12
1    34
2    15
3     8
4    22
5    10
6     8
7    -4
dtype: int64

In [ ]:
print(s.sort_values(ascending=False))

1    34
4    22
2    15
0    12
5    10
3     8
6     8
7    -4
dtype: int64

In [ ]:
print(s.sort_values(ascending=False,inplace=True))
print(s)

None
1    34
4    22
2    15
0    12
5    10
3     8
6     8
7    -4
dtype: int64

In [ ]:
print(s.head(2))

1    34
4    22
dtype: int64

In [ ]:
print(s[0:2])

1    34
4    22
dtype: int64

In [ ]:
print(s.tail(3))

3    8
6    8
7   -4
dtype: int64

In [ ]:
s=pd.Series([12,34,15,8,22,10,8,-4])
print(s)

0    12
1    34
2    15
3     8
4    22
5    10
6     8
7    -4
dtype: int64

In [ ]:
s=pd.Series([12,34,15,8,22,10,8,-4])
print(s)

0    12
1    34
2    15
3     8
4    22
5    10
6     8
7    -4
dtype: int64

In [ ]:
print(s.nlargest(3))

1    34
4    22
2    15
dtype: int64

In [ ]:
print(s.nsmallest(3))

7   -4
3    8
6    8
dtype: int64

In [ ]:
s=pd.Series([12,34,15,8,22,10,8])
print(s)

0    12
1    34
2    15
3     8
4    22
5    10
6     8
dtype: int64

In [ ]:
print("sum=",s.sum())
print("product=",s.product())
print("mean=",s.mean())

sum= 109
product= 86169600
mean= 15.571428571428571

In [ ]:
# new method to get all at once 
s=pd.Series([12,34,15,8,22,10,8])
s.agg(["sum","prod","mean","median"])

sum       1.090000e+02
prod      8.616960e+07
mean      1.557143e+01
median    1.200000e+01
dtype: float64

In [ ]:
# working with missing dependencies values

In [ ]:
# to work with csv files

# pd.read_csv("absolute path of csv file")

# pandas.read_csv("absolute path of pandas")

# this are separated by double slash

# by default , the pandas read_csv() will be imported as dataframe

# if we want data to be imported into series instead of dataframe we provide additional argument use cols and squeeze , the squeeze=true will convert a dataframe of one column into series.

In [ ]:
names=["Rossum","traVis","itTy","DhurVi","dEEp"]
lst=[name.lower() for name in names]
print(lst)

['rossum', 'travis', 'itty', 'dhurvi', 'deep']

In [ ]:
names=["Rossum","traVis","itTy","DhurVi","dEEp"]
lst=[name.upper() for name in names]
print(lst)

['ROSSUM', 'TRAVIS', 'ITTY', 'DHURVI', 'DEEP']

In [ ]:
names=["Rossum","traVis","itTy","DhurVi","dEEp"]
lst=[len(str(name)) for name in names]
print(lst)

[6, 6, 4, 6, 4]

In [ ]:
names=["Rossum","traVis","itTy","DhurVi","dEEp"]
lst={str(name):len(str(name)) for name in names}
print(lst)

{'Rossum': 6, 'traVis': 6, 'itTy': 4, 'DhurVi': 6, 'dEEp': 4}

In [ ]:
names=["Rossum","traVis","itTy","DhurVi","dEEp"]
lst={str(name.lower()):len(str(name)) for name in names}
print(lst)

{'rossum': 6, 'travis': 6, 'itty': 4, 'dhurvi': 6, 'deep': 4}

In [ ]:
names=["Rossum","traVis","itTy","DhurVi","dEEp"]
s=pd.Series(names)
uperCaseNames=pd.Series([str(name).upper() for name in s]).sort_values()
print(uperCaseNames)

4      DEEP
3    DHURVI
2      ITTY
0    ROSSUM
1    TRAVIS
dtype: object

In [ ]:
names=["Rossum","traVis","itTy","DhurVi","dEEp"]
s=pd.Series(names)
uperCaseNames=pd.Series([str(name).lower() for name in s]).sort_values()
print(uperCaseNames)

4      deep
3    dhurvi
2      itty
0    rossum
1    travis
dtype: object

# data frame
- dataframe is one of the class and whose object allows us to store the data in tabular format or 2d format and we can perform data analysis.
- data frame is one of the 2 dimension label array capable of storing similar type or diffrent type or both type in single object.
- even we store multiple value of diffrent type internally those value are treated as object .
- dataframe=data set + indices + columns 
- data set represent the collection of values and they may contain same type or diffrent type
- indices represent row indices , whose indices by default start from 0 to N-1, here N is the number of rows.
- the default rows indices can be assigned by programmer accordinng to programmer choice.
- column represent column indices , whose default start from 0 to M-1 here M is the number of columns.
- an objectof dataframe is "Mutable"  we can perform many operation at same address.

In [ ]:
# number of approaches to create an object of dataframe:-

"""  

syntax:- 

varname= pandas.DataFrame(object,index,columns,dtype)

"""

'  \n\nsyntax:- \n\nvarname= pandas.DataFrame(object,index,columns,dtype)\n\n'

In [ ]:
a=10
print(a,type(a))

10 <class 'int'>

In [ ]:
a=10

df=pd.DataFrame(a)
print(df)

ValueError: DataFrame constructor not properly called!

In [ ]:
# note :
""" 
- therefore above is ValueError
-for single value there is no meaning for creating dataset. 
-single value cannot be created as dimension
"""

' \n- therefore above is ValueError\n-for single value there is no meaning for creating dataset. \n-single value cannot be created as dimension\n'

In [ ]:
a=10.12

df=pd.DataFrame(a)
print(df)

ValueError: DataFrame constructor not properly called!

In [ ]:
a="python"

df=pd.DataFrame(a)
print(df)

ValueError: DataFrame constructor not properly called!

In [ ]:
# ValueError

In [ ]:
a=1000
# here a is a int single value
# convert it into list 
lst=list([a])
print(lst)

[1000]

In [ ]:
# convert it into dataframe
a=1000
# here a is a int single value
# convert it into list 
lst=list([a])
print(lst)
df=pd.DataFrame(lst)
print(df)

[1000]
      0
0  1000

In [ ]:
s="python"
lst=list(s)
print(lst)
df=pd.DataFrame(lst)
print(df)

['p', 'y', 't', 'h', 'o', 'n']
   0
0  p
1  y
2  t
3  h
4  o
5  n

In [ ]:
# convert the lsit into dataframe
lst =[100,"rossum","travis",32.22,"hunter"]
print(lst)
df=pd.DataFrame(lst)
print(df)
print(type(df))

[100, 'rossum', 'travis', 32.22, 'hunter']
        0
0     100
1  rossum
2  travis
3   32.22
4  hunter
<class 'pandas.core.frame.DataFrame'>

In [ ]:
# convert the lsit into dataframe
lst =[100,"rossum","travis",32.22,"hunter",[10,20,30]]
print(lst)
df=pd.DataFrame(lst)
print(df)
print(type(df))

[100, 'rossum', 'travis', 32.22, 'hunter', [10, 20, 30]]
              0
0           100
1        rossum
2        travis
3         32.22
4        hunter
5  [10, 20, 30]
<class 'pandas.core.frame.DataFrame'>

In [ ]:
lst=[[10,20,30],["rossum","travis","hunter"]]
print(lst)
print(50*"-")
df=pd.DataFrame(lst,columns=["id","name","famous"])
print(df)

[[10, 20, 30], ['rossum', 'travis', 'hunter']]
--------------------------------------------------
       id    name  famous
0      10      20      30
1  rossum  travis  hunter

In [ ]:
# convert list value into dataframe

lst=[[10,"rs"],[20,"ts"],[30,"hs"]]
print(lst)
print(50*"-")
df=pd.DataFrame(lst,index=["row1","row2","row3"],columns=["id","name"])
print(df)

[[10, 'rs'], [20, 'ts'], [30, 'hs']]
--------------------------------------------------
      id name
row1  10   rs
row2  20   ts
row3  30   hs

In [ ]:
# convert tuple value into dataframe

lst=([10,"rs"],[20,"ts"],[30,"hs"])
print(lst)
print(50*"-")
df=pd.DataFrame(lst,index=["row1","row2","row3"],columns=["id","name"])
print(df)

([10, 'rs'], [20, 'ts'], [30, 'hs'])
--------------------------------------------------
      id name
row1  10   rs
row2  20   ts
row3  30   hs

In [ ]:
# convert tuple value into dataframe

lst=((10,"rs"),(20,"ts"),(30,"hs"))
print(lst)
print(50*"-")
df=pd.DataFrame(lst,index=["row1","row2","row3"],columns=["id","name"])
print(df)

((10, 'rs'), (20, 'ts'), (30, 'hs'))
--------------------------------------------------
      id name
row1  10   rs
row2  20   ts
row3  30   hs

In [ ]:
# set
st={10,20,30,40,50}
print(st)
df=pd.DataFrame(st)
print(df)

{50, 20, 40, 10, 30}
    0
0  50
1  20
2  40
3  10
4  30

In [ ]:
#dictionary
d={100:"rs",200:"ts",300:"hs"}
print(d)

{100: 'rs', 200: 'ts', 300: 'hs'}

In [ ]:
d={"sub1":["pyhton","javascript","datascience"],"sub2":["html","css","react"],"sub3":["oracle","sql","mongodb"]}

print(d,type(d))

{'sub1': ['pyhton', 'javascript', 'datascience'], 'sub2': ['html', 'css', 'react'], 'sub3': ['oracle', 'sql', 'mongodb']} <class 'dict'>

In [ ]:
for key, value in d.items():
    print(key,"->",value)

sub1 -> ['pyhton', 'javascript', 'datascience']
sub2 -> ['html', 'css', 'react']
sub3 -> ['oracle', 'sql', 'mongodb']

In [ ]:
d={"sub1":["pyhton","javascript","datascience"],"sub2":["html","css","react"],"sub3":["oracle","sql","mongodb"]}

print(d,type(d))

df=pd.DataFrame(d)
print(df,type(df))

{'sub1': ['pyhton', 'javascript', 'datascience'], 'sub2': ['html', 'css', 'react'], 'sub3': ['oracle', 'sql', 'mongodb']} <class 'dict'>
          sub1   sub2     sub3
0       pyhton   html   oracle
1   javascript    css      sql
2  datascience  react  mongodb <class 'pandas.core.frame.DataFrame'>

In [ ]:
d={"sub1":["pyhton","javascript","datascience"],"sub2":["html","css","react"],"sub3":["oracle","sql","mongodb"]}

print(d,type(d))

df=pd.DataFrame(d,index=["level1","level2","level3"])
print(df,type(df))

{'sub1': ['pyhton', 'javascript', 'datascience'], 'sub2': ['html', 'css', 'react'], 'sub3': ['oracle', 'sql', 'mongodb']} <class 'dict'>
               sub1   sub2     sub3
level1       pyhton   html   oracle
level2   javascript    css      sql
level3  datascience  react  mongodb <class 'pandas.core.frame.DataFrame'>

In [ ]:
# creating dataframe object by using dict
d={10:"python",20:"java",30:"c",40:"c++"}
print(d)
print(50*"-")
df=pd.DataFrame(d)
print(df,type(df))

{10: 'python', 20: 'java', 30: 'c', 40: 'c++'}
--------------------------------------------------

ValueError: If using all scalar values, you must pass an index

In [ ]:
# you will get the value error 
# since you are passing the single value in dict
# for removing error you need to provide the index

In [ ]:
# creating dataframe object by using dict
d={10:"python",20:"java",30:"c",40:"c++"}
print(d)
print(50*"-")
df=pd.DataFrame(d,index=["course"])
print(df,type(df))

{10: 'python', 20: 'java', 30: 'c', 40: 'c++'}
--------------------------------------------------
            10    20 30   40
course  python  java  c  c++ <class 'pandas.core.frame.DataFrame'>

In [ ]:
# creating nd array object
d={"sub1":["pyhton","javascript","datascience"],"sub2":["html","css","react"],"sub3":["oracle","sql","mongodb"]}

print(d,type(d))

a=np.array(d)
print(a,type(a))
print(a.ndim)

{'sub1': ['pyhton', 'javascript', 'datascience'], 'sub2': ['html', 'css', 'react'], 'sub3': ['oracle', 'sql', 'mongodb']} <class 'dict'>
{'sub1': ['pyhton', 'javascript', 'datascience'], 'sub2': ['html', 'css', 'react'], 'sub3': ['oracle', 'sql', 'mongodb']} <class 'numpy.ndarray'>
0

In [ ]:
# creating dataframe obejct using dict
d={"sub1":["pyhton","javascript","datascience"],"sub2":["html","css","react"],"sub3":["oracle","sql","mongodb"]}
a=np.array(d)
print(a,type(a))
print(a.ndim)
df=pd.DataFrame(a)
print(df,type(df))

{'sub1': ['pyhton', 'javascript', 'datascience'], 'sub2': ['html', 'css', 'react'], 'sub3': ['oracle', 'sql', 'mongodb']} <class 'numpy.ndarray'>
0

ValueError: Must pass 2-d input. shape=()

In [ ]:
# you will get the value error 
# to make txt file to csv file ["fileName.csv"] it must be contain with in the double quoted string

In [ ]:
# create an object of dataframe by using csv file
#syntax
""" 
dataframeObj=pandas.read_csv("absolute path of csv with double slash")
"""
df=pd.read_csv("D:\\clone\\DataAnalyst_DPK\\files\\student.csv")
print(df)

   sno   sname  marks
0  100  rossum  45.67
1  200  travis  56.87
2  300  hunter  66.10

In [ ]:
df.set_index("sno")

      sname  marks
sno
100  rossum  45.67
200  travis  56.87
300  hunter  66.10

# Attributes of dataframe objects:-
1. index
2. columns
3. dtype
4. shape
5. size
6. ndim
7. empty
8. T
9. values
10. axis

In [ ]:
# creating a 2d dictionary

data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [25, 30, 28, 35],
    'City': ['New York', 'Paris', 'London', 'Tokyo']
}

In [ ]:
# creating a 2d dictionary
dict={"student":["arvind","aryan","travis","rossum"],"marks":[85,78,80,90],"sports":["cricket","tennis","volleyball","badminton"]}

# creating it into dataframe

In [ ]:
df=pd.DataFrame(dict)
print(df)

  student  marks      sports
0  arvind     85     cricket
1   aryan     78      tennis
2  travis     80  volleyball
3  rossum     90   badminton

In [ ]:
print(df.index)

RangeIndex(start=0, stop=4, step=1)

In [ ]:
# column attribute 
print(df.columns)

Index(['student', 'marks', 'sports'], dtype='object')

In [ ]:
print(df.axes)

[RangeIndex(start=0, stop=4, step=1), Index(['student', 'marks', 'sports'], dtype='object')]

In [ ]:
dict={"sales":{"name":"rossum","age":67,"gender":"male"},"marketting":{"name":"travis","age":65,"gender":"female"}}
df=pd.DataFrame(dict)
print(df)

         sales marketting
name    rossum     travis
age         67         65
gender    male     female

In [ ]:
print(df.axes)

[Index(['name', 'age', 'gender'], dtype='object'), Index(['sales', 'marketting'], dtype='object')]

In [ ]:
# axes will show you both x-axis and y-axis

In [ ]:
print(df.T)

              name age  gender
sales       rossum  67    male
marketting  travis  65  female

# category data types :~

In [ ]:
import pandas as pd
s=pd.Series(["python","java","python","c++","java","dsc","dsc","python","java"])
print(s,type(s))

0    python
1      java
2    python
3       c++
4      java
5       dsc
6       dsc
7    python
8      java
dtype: object <class 'pandas.core.series.Series'>

In [ ]:
s=pd.Series(["python","java","python","c++","java","dsc","dsc","python","java"],dtype="category")
print(s,type(s))

0    python
1      java
2    python
3       c++
4      java
5       dsc
6       dsc
7    python
8      java
dtype: category
Categories (4, object): ['c++', 'dsc', 'java', 'python'] <class 'pandas.core.series.Series'>

In [ ]:
# dtype="category" will group the dataset

# Accessing the data from dataframe:-
- dataframeobj[index]
- dataframeObj[StartIndex:EndIndex]
- dataframeObj[StartIndex:]
- dataframeObj[:EndIndex]
- dataframeObj[StartIndex:EndIndex:stepIndex]
- dataframeObj.head()
- dataframeObj.tail()
- dataframeObj.iterrows()
- dataframeObj.head()
- dataframeObj.describe()
- dataframeObj.at()
- dataframeObj.iat()
- dataframeObj.iloc()
- dataframeObj.loc()

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# get the data from student.csv into dataframe
df= pd.read_csv("D:\\clone\\DataAnalyst_DPK\\files\\student-dataset.csv")
print("="*50)
print(df)
print("="*50)

NameError: name 'pd' is not defined

In [ ]:
# column attribute 
print(df.columns)

NameError: name 'df' is not defined

In [ ]:
df.head()
# obtain the first five records / rows from datatframe

,id,name,nationality,city,latitude,longitude,gender,ethnic.group,age,english.grade,math.grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating
0,0,Kiana Lor,China,Suzhou,31.31,120.62,F,NaN,22,3.5,3.7,3.1,1.0,4,4.0,4
1,1,Joshua Lonaker,United States of America,Santa Clarita,34.39,-118.54,M,NaN,22,2.9,3.2,3.6,5.0,5,4.0,5
2,2,Dakota Blanco,United States of America,Oakland,37.80,-122.27,F,NaN,22,3.9,3.8,3.2,5.0,3,3.0,4
3,3,Natasha Yarusso,United States of America,Castro Valley,37.69,-122.09,F,NaN,20,3.3,2.8,3.2,5.0,5,2.0,4
4,4,Brooke Cazares,Brazil,São José dos Campos,-23.18,-45.88,F,NaN,21,3.7,2.6,3.4,1.0,4,4.0,5

In [ ]:
df.tail()
# obtain the last five records / rows from datatframe

,id,name,nationality,city,latitude,longitude,gender,ethnic.group,age,english.grade,math.grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating
302,302,Austin Haas,United States of America,Columbus,39.96,-83.00,M,NaN,20,3.6,3.7,3.1,5.0,4,5.0,5
303,303,Madison Fithian,United States of America,Los Angeles,34.05,-118.24,F,NaN,20,3.6,3.9,4.0,5.0,5,5.0,3
304,304,Zachary Mulvahill,United States of America,Los Angeles,34.05,-118.24,M,NaN,20,3.2,3.4,3.9,5.0,5,5.0,3
305,305,Eliana Michelsen,United States of America,Oakland,37.80,-122.27,F,NaN,23,3.0,2.8,2.9,5.0,4,4.0,5
306,306,Dane Whittemore,Canada,Toronto,43.67,-79.42,M,NaN,21,3.8,3.2,4.0,5.0,5,4.0,5

In [ ]:
df.head(3)
# to get the first three record

,id,name,nationality,city,latitude,longitude,gender,ethnic.group,age,english.grade,math.grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating
0,0,Kiana Lor,China,Suzhou,31.31,120.62,F,NaN,22,3.5,3.7,3.1,1.0,4,4.0,4
1,1,Joshua Lonaker,United States of America,Santa Clarita,34.39,-118.54,M,NaN,22,2.9,3.2,3.6,5.0,5,4.0,5
2,2,Dakota Blanco,United States of America,Oakland,37.80,-122.27,F,NaN,22,3.9,3.8,3.2,5.0,3,3.0,4

In [ ]:
df.describe()
# this function give the statistical summary of the dataframe

,id,latitude,longitude,ethnic.group,age,english.grade,math.grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating
count,307.000000,307.000000,307.000000,0.0,307.000000,307.000000,307.000000,307.000000,307.000000,307.000000,307.000000,307.000000
mean,153.000000,32.863388,-64.539121,NaN,21.964169,3.369707,3.414332,3.446580,4.396417,3.986971,4.110749,4.188925
std,88.767487,13.498582,81.249146,NaN,1.248013,0.538724,0.476839,0.509081,0.996474,0.928749,0.823936,0.842193
min,0.000000,-33.450000,-123.130000,NaN,19.000000,1.500000,2.100000,1.400000,1.000000,1.000000,1.000000,1.000000
25%,76.500000,32.720000,-118.240000,NaN,21.000000,3.100000,3.100000,3.200000,4.000000,3.500000,4.000000,4.000000
50%,153.000000,34.390000,-99.140000,NaN,22.000000,3.500000,3.500000,3.600000,5.000000,4.000000,4.000000,4.000000
75%,229.500000,38.960000,-73.855000,NaN,23.000000,3.800000,3.800000,3.800000,5.000000,5.000000,5.000000,5.000000
max,306.000000,59.890000,139.750000,NaN,26.000000,4.000000,4.000000,4.000000,5.000000,5.000000,5.000000,5.000000

In [ ]:
df.shape
# it will give you the row and column count of the dataframe

(307, 16)

In [ ]:
# obtain the column
df.columns

Index(['id', 'name', 'nationality', 'city', 'latitude', 'longitude', 'gender',
       'ethnic.group', 'age', 'english.grade', 'math.grade', 'sciences.grade',
       'language.grade', 'portfolio.rating', 'coverletter.rating',
       'refletter.rating'],
      dtype='object')

In [ ]:
# obtain the row
df.shape[0]

307

In [ ]:
# obtain the column
df.shape[1]

16

In [ ]:
df.index

RangeIndex(start=0, stop=307, step=1)

In [ ]:
df1=df[4:10:2]
df1

,id,name,nationality,city,latitude,longitude,gender,ethnic.group,age,english.grade,math.grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating
4,4,Brooke Cazares,Brazil,São José dos Campos,-23.18,-45.88,F,NaN,21,3.7,2.6,3.4,1.0,4,4.0,5
6,6,Joey Abreu,China,Shenyang,41.79,123.43,M,NaN,22,3.7,3.9,3.6,2.0,5,5.0,5
8,8,Lee Dong,Philippines,Manila,14.60,120.98,F,NaN,24,3.9,3.6,3.2,2.0,4,3.0,5

In [ ]:
# to get the center of the dataframe
df[len(df)//2:len(df)//2+1]

,id,name,nationality,city,latitude,longitude,gender,ethnic.group,age,english.grade,math.grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating
153,153,Jenna Whitney,United States of America,San Diego,32.72,-117.16,F,NaN,23,3.7,2.9,3.9,5.0,3,4.0,5

In [ ]:
# extract the data based on column name

In [ ]:
# get the names
df['name']

0              Kiana Lor
1         Joshua Lonaker
2          Dakota Blanco
3        Natasha Yarusso
4         Brooke Cazares
             ...
302          Austin Haas
303      Madison Fithian
304    Zachary Mulvahill
305     Eliana Michelsen
306      Dane Whittemore
Name: name, Length: 307, dtype: object

In [ ]:
seriesObj=df['name']

In [ ]:
print(seriesObj)

0              Kiana Lor
1         Joshua Lonaker
2          Dakota Blanco
3        Natasha Yarusso
4         Brooke Cazares
             ...
302          Austin Haas
303      Madison Fithian
304    Zachary Mulvahill
305     Eliana Michelsen
306      Dane Whittemore
Name: name, Length: 307, dtype: object

In [ ]:
df[['name','age']]

                  name  age
0            Kiana Lor   22
1       Joshua Lonaker   22
2        Dakota Blanco   22
3      Natasha Yarusso   20
4       Brooke Cazares   21
..                 ...  ...
302        Austin Haas   20
303    Madison Fithian   20
304  Zachary Mulvahill   20
305   Eliana Michelsen   23
306    Dane Whittemore   21

[307 rows x 2 columns]

In [ ]:
df['nationality']

0                         China
1      United States of America
2      United States of America
3      United States of America
4                        Brazil
                 ...
302    United States of America
303    United States of America
304    United States of America
305    United States of America
306                      Canada
Name: nationality, Length: 307, dtype: object

# get the column of desire
- syntax:-
    dataFrameObj[['colName1','colName2',...'colName-n']][startIndex:EndIndex:StepIndex]

In [ ]:
for record in df.iterrows():
    print(record)

(0, id                            0
name                  Kiana Lor
nationality               China
city                     Suzhou
latitude                  31.31
longitude                120.62
gender                        F
ethnic.group                NaN
age                          22
english.grade               3.5
math.grade                  3.7
sciences.grade              3.1
language.grade              1.0
portfolio.rating              4
coverletter.rating          4.0
refletter.rating              4
Name: 0, dtype: object)
(1, id                                           1
name                            Joshua Lonaker
nationality           United States of America
city                             Santa Clarita
latitude                                 34.39
longitude                              -118.54
gender                                       M
ethnic.group                               NaN
age                                         22
english.grade                              2.9
math.grade                                 3.2
sciences.grade                             3.6
language.grade                             5.0
portfolio.rating                             5
coverletter.rating                         4.0
refletter.rating                             5
Name: 1, dtype: object)
(2, id                                           2
name                             Dakota Blanco
nationality           United States of America
city                                   Oakland
latitude                                  37.8
longitude                              -122.27
gender                                       F
ethnic.group                               NaN
age                                         22
english.grade                              3.9
math.grade                                 3.8
sciences.grade                             3.2
language.grade                             5.0
portfolio.rating                             3
coverletter.rating                         3.0
refletter.rating                             4
Name: 2, dtype: object)
(3, id                                           3
name                           Natasha Yarusso
nationality           United States of America
city                             Castro Valley
latitude                                 37.69
longitude                              -122.09
gender                                       F
ethnic.group                               NaN
age                                         20
english.grade                              3.3
math.grade                                 2.8
sciences.grade                             3.2
language.grade                             5.0
portfolio.rating                             5
coverletter.rating                         2.0
refletter.rating                             4
Name: 3, dtype: object)
(4, id                                      4
name                       Brooke Cazares
nationality                        Brazil
city                  São José dos Campos
latitude                           -23.18
longitude                          -45.88
gender                                  F
ethnic.group                          NaN
age                                    21
english.grade                         3.7
math.grade                            2.6
sciences.grade                        3.4
language.grade                        1.0
portfolio.rating                        4
coverletter.rating                    4.0
refletter.rating                        5
Name: 4, dtype: object)
(5, id                                           5
name                          Rochelle Johnson
nationality           United States of America
city                              Indianapolis
latitude                                 39.77
longitude                               -86.16
gender                                       F
ethnic.group                               NaN
age                                         21
english.grade                              3.4
math.grade                                 3.1
sciences.grade                             3.7
language.grade                             5.0
portfolio.rating                             2
coverletter.rating                         4.0
refletter.rating                             4
Name: 5, dtype: object)
(6, id                             6
name                  Joey Abreu
nationality                China
city                    Shenyang
latitude                   41.79
longitude                 123.43
gender                         M
ethnic.group                 NaN
age                           22
english.grade                3.7
math.grade                   3.9
sciences.grade               3.6
language.grade               2.0
portfolio.rating               5
coverletter.rating           5.0
refletter.rating               5
Name: 6, dtype: object)
(7, id                                 7
name                  Preston Suarez
nationality                   Brazil
city                       São Paulo
latitude                      -23.47
longitude                     -46.67
gender                             M
ethnic.group                     NaN
age                               22
english.grade                    3.8
math.grade                       3.7
sciences.grade                   3.6
language.grade                   2.0
portfolio.rating                   5
coverletter.rating               5.0
refletter.rating                   4
Name: 7, dtype: object)
(8, id                              8
name                     Lee Dong
nationality           Philippines
city                       Manila
latitude                     14.6
longitude                  120.98
gender                          F
ethnic.group                  NaN
age                            24
english.grade                 3.9
math.grade                    3.6
sciences.grade                3.2
language.grade                2.0
portfolio.rating                4
coverletter.rating            3.0
refletter.rating                5
Name: 8, dtype: object)
(9, id                                9
name                  Maa'iz al-Dia
nationality                  Turkey
city                       Istanbul
latitude                      41.02
longitude                     28.96
gender                            M
ethnic.group                    NaN
age                              22
english.grade                   2.4
math.grade                      2.8
sciences.grade                  3.8
language.grade                  3.0
portfolio.rating                  5
coverletter.rating              5.0
refletter.rating                  4
Name: 9, dtype: object)
(10, id                                          10
name                            Maja Nicholson
nationality           United States of America
city                                    Dallas
latitude                                 32.78
longitude                                -96.8
gender                                       F
ethnic.group                               NaN
age                                         23
english.grade                              3.4
math.grade                                 3.5
sciences.grade                             3.2
language.grade                             5.0
portfolio.rating                             4
coverletter.rating                         2.0
refletter.rating                             5
Name: 10, dtype: object)
(11, id                                          11
name                              Sasha Jansen
nationality           United States of America
city                                   Chicago
latitude                                 41.85
longitude                               -87.65
gender                                       F
ethnic.group                               NaN
age                                         21
english.grade                              1.7
math.grade                                 4.0
sciences.grade                             3.6
language.grade                             5.0
portfolio.rating                             4
coverletter.rating                         4.0
refletter.rating                             5
Name: 11, dtype: object)
(12, id                                          12
name                         Alexander Sherman
nationality           United States of America
city                                     Omaha
latitude                                 41.26
longitude                               -95.94
gender                                       M
ethnic.group                               NaN
age                                         20
english.grade                              3.8
math.grade                                 3.6
sciences.grade                             3.9
language.grade                             5.0
portfolio.rating                             4
coverletter.rating                         4.0
refletter.rating                             5
Name: 12, dtype: object)
(13, id                               13
name                  Edgar Sanchez
nationality                  Mexico
city                        Tijuana
latitude                      32.53
longitude                   -117.02
gender                            M
ethnic.group                    NaN
age                              23
english.grade                   3.7
math.grade                      3.5
sciences.grade                  4.0
language.grade                  4.0
portfolio.rating                  4
coverletter.rating              5.0
refletter.rating                  5
Name: 13, dtype: object)
(14, id                                          14
name                              Kolbi Strunk
nationality           United States of America
city                             Mission Viejo
latitude                                  33.6
longitude                              -117.67
gender                                       M
ethnic.group                               NaN
age                                         21
english.grade                              3.2
math.grade                                 3.9
sciences.grade                             3.3
language.grade                             5.0
portfolio.rating                             4
coverletter.rating                         3.0
refletter.rating                             4
Name: 14, dtype: object)
(15, id                               15
name                  Brittany Sath
nationality                   Japan
city                          Tokyo
latitude                      35.69
longitude                    139.75
gender                            F
ethnic.group                    NaN
age                              21
english.grade                   4.0
math.grade                      3.9
sciences.grade                  3.7
language.grade                  3.0
portfolio.rating                  5
coverletter.rating              3.0
refletter.rating                  5
Name: 15, dtype: object)
(16, id                                          16
name                              Meggan Smith
nationality           United States of America
city                               Los Angeles
latitude                                 34.05
longitude                              -118.24
gender                                       F
ethnic.group                               NaN
age                                         21
english.grade                              2.9
math.grade                                 3.4
sciences.grade                             3.6
language.grade                             5.0
portfolio.rating                             2
coverletter.rating                         5.0
refletter.rating                             4
Name: 16, dtype: object)
(17, id                                17
name                  Ericka Arreola
nationality                   Mexico
city                          Mexico
latitude                       19.43
longitude                     -99.14
gender                         other
ethnic.group                     NaN
age                               23
english.grade                    3.1
math.grade                       3.5
sciences.grade                   2.8
language.grade                   4.0
portfolio.rating                   4
coverletter.rating               3.0
refletter.rating                   4
Name: 17, dtype: object)
(18, id                            18
name                  David Pulc
nationality               Canada
city                     Toronto
latitude                   43.67
longitude                 -79.42
gender                         M
ethnic.group                 NaN
age                           24
english.grade                3.9
math.grade                   2.9
sciences.grade               4.0
language.grade               5.0
portfolio.rating               5
coverletter.rating           4.0
refletter.rating               2
Name: 18, dtype: object)
(19, id                                          19
name                               Kyle Luckey
nationality           United States of America
city                             Moreno Valley
latitude                                 33.94
longitude                              -117.23
gender                                       M
ethnic.group                               NaN
age                                         23
english.grade                              3.7
math.grade                                 3.9
sciences.grade                             3.4
language.grade                             5.0
portfolio.rating                             3
coverletter.rating                         4.0
refletter.rating                             4
Name: 19, dtype: object)
(20, id                            20
name                  Rojesh Her
nationality                Japan
city                       Tokyo
latitude                   35.69
longitude                 139.75
gender                         M
ethnic.group                 NaN
age                           22
english.grade                3.8
math.grade                   3.6
sciences.grade               3.6
language.grade               2.0
portfolio.rating               4
coverletter.rating           4.0
refletter.rating               3
Name: 20, dtype: object)
(21, id                             21
name                  David Weber
nationality                 China
city                       Peking
latitude                    39.93
longitude                  116.39
gender                          M
ethnic.group                  NaN
age                            20
english.grade                 3.9
math.grade                    3.9
sciences.grade                3.9
language.grade                2.0
portfolio.rating                3
coverletter.rating            4.0
refletter.rating                5
Name: 21, dtype: object)
(22, id                                          22
name                             Rachel Jambor
nationality           United States of America
city                                   Chicago
latitude                                 41.85
longitude                               -87.65
gender                                       F
ethnic.group                               NaN
age                                         22
english.grade                              3.6
math.grade                                 3.6
sciences.grade                             3.9
language.grade                             5.0
portfolio.rating                             3
coverletter.rating                         4.0
refletter.rating                             4
Name: 22, dtype: object)
(23, id                                    23
name                  Mus'ab al-Moustafa
nationality                     Pakistan
city                          Rawalpindi
latitude                            33.6
longitude                          73.07
gender                                 M
ethnic.group                         NaN
age                                   23
english.grade                        3.8
math.grade                           3.9
sciences.grade                       3.8
language.grade                       2.0
portfolio.rating                       2
coverletter.rating                   5.0
refletter.rating                       4
Name: 23, dtype: object)
(24, id                             24
name                  Sila Nguyen
nationality                 China
city                         Hebi
latitude                     35.9
longitude                  114.19
gender                          M
ethnic.group                  NaN
age                            23
english.grade                 2.8
math.grade                    3.5
sciences.grade                3.5
language.grade                4.0
portfolio.rating                5
coverletter.rating            4.0
refletter.rating                4
Name: 24, dtype: object)
(25, id                                          25
name                            Samantha Hicks
nationality           United States of America
city                             Santa Barbara
latitude                                 34.42
longitude                               -119.7
gender                                       F
ethnic.group                               NaN
age                                         22
english.grade                              3.7
math.grade                                 3.7
sciences.grade                             3.8
language.grade                             5.0
portfolio.rating                             3
coverletter.rating                         4.0
refletter.rating                             4
Name: 25, dtype: object)
(26, id                                          26
name                            Angela Harding
nationality           United States of America
city                                   Manteca
latitude                                  37.8
longitude                              -121.22
gender                                       F
ethnic.group                               NaN
age                                         22
english.grade                              3.1
math.grade                                 2.9
sciences.grade                             3.2
language.grade                             5.0
portfolio.rating                             3
coverletter.rating                         5.0
refletter.rating                             5
Name: 26, dtype: object)
(27, id                                          27
name                           Brandon Barbour
nationality           United States of America
city                                South Hill
latitude                                 47.14
longitude                              -122.27
gender                                       M
ethnic.group                               NaN
age                                         21
english.grade                              3.9
math.grade                                 3.7
sciences.grade                             3.3
language.grade                             5.0
portfolio.rating                             4
coverletter.rating                         5.0
refletter.rating                             5
Name: 27, dtype: object)
(28, id                                          28
name                              Reilly Wagar
nationality           United States of America
city                                   Modesto
latitude                                 37.64
longitude                               -121.0
gender                                       F
ethnic.group                               NaN
age                                         23
english.grade                              3.4
math.grade                                 3.2
sciences.grade                             3.7
language.grade                             5.0
portfolio.rating                             5

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 307 entries, 0 to 306
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  307 non-null    int64
 1   name                307 non-null    object
 2   nationality         307 non-null    object
 3   city                307 non-null    object
 4   latitude            307 non-null    float64
 5   longitude           307 non-null    float64
 6   gender              307 non-null    object
 7   ethnic.group        0 non-null      float64
 8   age                 307 non-null    int64
 9   english.grade       307 non-null    float64
 10  math.grade          307 non-null    float64
 11  sciences.grade      307 non-null    float64
 12  language.grade      307 non-null    float64
 13  portfolio.rating    307 non-null    int64
 14  coverletter.rating  307 non-null    float64
 15  refletter.rating    307 non-null    int64
dtypes: float64(8), int64(4), object(4)
memory usage: 38.5+ KB

In [ ]:
# pandas --> loc and iloc

"""  
loc and iloc uses square bracket
-> present in both in series and  dataframes object.
-> 
-----------------------
=>loc[] is used for slicing the data either on the basis row index and column index.
=> loc[] always take row index and column names only (never take column index)
syntax: dataFrameObj.loc[]
dataFrameObj.loc[row_number]
dataFrameObj.loc[row_number,[col name,..]]
dataFrameObj.loc[start:stop:step,[col name]]


"""

'  \nloc and iloc uses square bracket\n-> present in both in series and  dataframes object.\n-> \n-----------------------\n=>loc[] is used for slicing the data either on the basis row index and column index.\n=> loc[] always take row index and column names only (never take column index)\nsyntax: dataFrameObj.loc[]\ndataFrameObj.loc[row_number]\ndataFrameObj.loc[row_number,[col name,..]]\ndataFrameObj.loc[start:stop:step,[col name]]\n\n\n'

In [ ]:
# info() - it is a pre defined function in series and dataframe object and the gives the following information

In [ ]:
import pandas as pd
import numpy as np
# get the data from student.csv into dataframe
df= pd.read_csv("D:\\clone\\DataAnalyst_DPK\\files\\student-dataset.csv")
print("="*50)
print(df)
print("="*50)

==================================================
      id               name               nationality                 city  \
0      0          Kiana Lor                     China               Suzhou
1      1     Joshua Lonaker  United States of America        Santa Clarita
2      2      Dakota Blanco  United States of America              Oakland
3      3    Natasha Yarusso  United States of America        Castro Valley
4      4     Brooke Cazares                    Brazil  São José dos Campos
..   ...                ...                       ...                  ...
302  302        Austin Haas  United States of America             Columbus
303  303    Madison Fithian  United States of America          Los Angeles
304  304  Zachary Mulvahill  United States of America          Los Angeles
305  305   Eliana Michelsen  United States of America              Oakland
306  306    Dane Whittemore                    Canada              Toronto

     latitude  longitude gender  ethnic.group  age  english.grade  math.grade  \
0       31.31     120.62      F           NaN   22            3.5         3.7
1       34.39    -118.54      M           NaN   22            2.9         3.2
2       37.80    -122.27      F           NaN   22            3.9         3.8
3       37.69    -122.09      F           NaN   20            3.3         2.8
4      -23.18     -45.88      F           NaN   21            3.7         2.6
..        ...        ...    ...           ...  ...            ...         ...
302     39.96     -83.00      M           NaN   20            3.6         3.7
303     34.05    -118.24      F           NaN   20            3.6         3.9
304     34.05    -118.24      M           NaN   20            3.2         3.4
305     37.80    -122.27      F           NaN   23            3.0         2.8
306     43.67     -79.42      M           NaN   21            3.8         3.2

     sciences.grade  language.grade  portfolio.rating  coverletter.rating  \
0               3.1             1.0                 4                 4.0
1               3.6             5.0                 5                 4.0
2               3.2             5.0                 3                 3.0
3               3.2             5.0                 5                 2.0
4               3.4             1.0                 4                 4.0
..              ...             ...               ...                 ...
302             3.1             5.0                 4                 5.0
303             4.0             5.0                 5                 5.0
304             3.9             5.0                 5                 5.0
305             2.9             5.0                 4                 4.0
306             4.0             5.0                 5                 4.0

     refletter.rating
0                   4
1                   5
2                   4
3                   4
4                   5
..                ...
302                 5
303                 3
304                 3
305                 5
306                 5

[307 rows x 16 columns]
==================================================

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 307 entries, 0 to 306
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  307 non-null    int64
 1   name                307 non-null    object
 2   nationality         307 non-null    object
 3   city                307 non-null    object
 4   latitude            307 non-null    float64
 5   longitude           307 non-null    float64
 6   gender              307 non-null    object
 7   ethnic.group        0 non-null      float64
 8   age                 307 non-null    int64
 9   english.grade       307 non-null    float64
 10  math.grade          307 non-null    float64
 11  sciences.grade      307 non-null    float64
 12  language.grade      307 non-null    float64
 13  portfolio.rating    307 non-null    int64
 14  coverletter.rating  307 non-null    float64
 15  refletter.rating    307 non-null    int64
dtypes: float64(8), int64(4), object(4)
memory usage: 38.5+ KB

In [ ]:
df.loc[3,["name","nationality"]]

name                    Natasha Yarusso
nationality    United States of America
Name: 3, dtype: object

In [ ]:
#syntax
#dataFrameObj.loc[row_number,[colName1,colName2..]]

In [ ]:
df.loc[3:7]

,id,name,nationality,city,latitude,longitude,gender,ethnic.group,age,english.grade,math.grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating
3,3,Natasha Yarusso,United States of America,Castro Valley,37.69,-122.09,F,NaN,20,3.3,2.8,3.2,5.0,5,2.0,4
4,4,Brooke Cazares,Brazil,São José dos Campos,-23.18,-45.88,F,NaN,21,3.7,2.6,3.4,1.0,4,4.0,5
5,5,Rochelle Johnson,United States of America,Indianapolis,39.77,-86.16,F,NaN,21,3.4,3.1,3.7,5.0,2,4.0,4
6,6,Joey Abreu,China,Shenyang,41.79,123.43,M,NaN,22,3.7,3.9,3.6,2.0,5,5.0,5
7,7,Preston Suarez,Brazil,São Paulo,-23.47,-46.67,M,NaN,22,3.8,3.7,3.6,2.0,5,5.0,4

In [ ]:
#iloc[]
"""  
=>iloc[] is used for slicing the data either on the basis rows(Index) and column(columns)
=>iloc[] always takes row indeces and never takes column indecs
=>
"""

'  \n=>iloc[] is used for slicing the data either on the basis rows(Index) and column(columns)\n=>iloc[] always takes row indeces and never takes column indecs\n=>\n'

In [ ]:
#syntax:
#dataFrameObj.iloc[row_number,[ColNumber1,colNumber2,..]]

#dataFrameObj.iloc[rowStart:rowStop:rowStep,colStart:colStop:colStep]

In [ ]:
#get the 7th records
df1=df.iloc[7]
df1

id                                 7
name                  Preston Suarez
nationality                   Brazil
city                       São Paulo
latitude                      -23.47
longitude                     -46.67
gender                             M
ethnic.group                     NaN
age                               22
english.grade                    3.8
math.grade                       3.7
sciences.grade                   3.6
language.grade                   2.0
portfolio.rating                   5
coverletter.rating               5.0
refletter.rating                   4
Name: 7, dtype: object

In [ ]:
# get the first name
y=df1["name"][:7]
y

'Preston'

In [ ]:
df.iloc[3:10,[1,3]]["name"]

3     Natasha Yarusso
4      Brooke Cazares
5    Rochelle Johnson
6          Joey Abreu
7      Preston Suarez
8            Lee Dong
9       Maa'iz al-Dia
Name: name, dtype: object

In [ ]:
#lec 30

Adding new column name to data frame :-

In [71]:
# how to add a new column 
# eno,name,sal,comm,compname
# 100,rossum,34.56,10.00,psf

In [72]:
import numpy as np
import pandas as pd

In [73]:
# get the data
df=pd.read_csv("D:\\clone\\DataAnalyst_DPK\\files\\student.csv")
print(df)

   sno   sname  marks
0  100  rossum  45.67
1  200  travis  56.87
2  300  hunter  66.10

In [74]:
# add a new column -total salary
# syntax for adding a new column name
# dataFrameObj[new column name]=value/expression

df["totsal"]=100

In [75]:
print(df)

   sno   sname  marks  totsal
0  100  rossum  45.67     100
1  200  travis  56.87     100
2  300  hunter  66.10     100

In [76]:
# get the data
df=pd.read_csv("D:\\clone\\DataAnalyst_DPK\\files\\emp.csv")
print(df)

   sno     name   sal  comm         com
0  100   rossum  8000    80         psf
1  200   travis  3500    35       numpy
2  300   kinney  4000    65      pandas
3  400  brendam  6000    50  javascript
4  500    rohit  5000    80       react
5  600   hunter  5500    90        next

In [77]:
# adding a new column to a data frame :-
# print the total salary
df["totalSal"]=df["sal"]+df["comm"]
print(df)

   sno     name   sal  comm         com  totalSal
0  100   rossum  8000    80         psf      8080
1  200   travis  3500    35       numpy      3535
2  300   kinney  4000    65      pandas      4065
3  400  brendam  6000    50  javascript      6050
4  500    rohit  5000    80       react      5080
5  600   hunter  5500    90        next      5590

In [78]:
# export or modify the emp.csv with modified data 
# to do this we use 
# dataFrameObj.to_csv("absolute_path")

In [79]:
df.to_csv("D:\\clone\\DataAnalyst_DPK\\files\\Modifiedemp.csv")
print(df)

   sno     name   sal  comm         com  totalSal
0  100   rossum  8000    80         psf      8080
1  200   travis  3500    35       numpy      3535
2  300   kinney  4000    65      pandas      4065
3  400  brendam  6000    50  javascript      6050
4  500    rohit  5000    80       react      5080
5  600   hunter  5500    90        next      5590

In [80]:
# another example
d={"a":[10,20,30,40],"b":[1,2,3,4],"c":[1.1,2.2,3.3,4.4]}
print(d,type(d))

{'a': [10, 20, 30, 40], 'b': [1, 2, 3, 4], 'c': [1.1, 2.2, 3.3, 4.4]} <class 'dict'>

In [81]:
for key,val in d.items():
    print(key,"-->",val)

a --> [10, 20, 30, 40]
b --> [1, 2, 3, 4]
c --> [1.1, 2.2, 3.3, 4.4]

In [82]:
# convert dict object into dataframe
df=pd.DataFrame(d)
print(df)

    a  b    c
0  10  1  1.1
1  20  2  2.2
2  30  3  3.3
3  40  4  4.4

In [83]:
# add a new column and add the value of a,b,c in it
df["sum"]=df["a"]+df["b"]+df["c"]
print(df)

    a  b    c   sum
0  10  1  1.1  12.1
1  20  2  2.2  24.2
2  30  3  3.3  36.3
3  40  4  4.4  48.4

In [84]:
df.to_csv("D:\\clone\\DataAnalyst_DPK\\files\\dictSum.csv")

In [85]:
# calculate the %
df["percentage"]=(df["sum"]/100)*100
print(df)

    a  b    c   sum  percentage
0  10  1  1.1  12.1        12.1
1  20  2  2.2  24.2        24.2
2  30  3  3.3  36.3        36.3
3  40  4  4.4  48.4        48.4

In [86]:
# create a student data table
studentData={"sno":[1,2,3,4],"name":["dhurvi","deepak","itty","rossum"],"eng":[98,95,95,99],"math":[100,96,96,98],"science":[99,92,94,93]}

# convert dict object into dataframe
df=pd.DataFrame(studentData)
print(df)
print("-"*50)
df.to_csv("D:\\clone\\DataAnalyst_DPK\\files\\studentData.csv")
print("-"*50)
print(df)

   sno    name  eng  math  science
0    1  dhurvi   98   100       99
1    2  deepak   95    96       92
2    3    itty   95    96       94
3    4  rossum   99    98       93
--------------------------------------------------
--------------------------------------------------
   sno    name  eng  math  science
0    1  dhurvi   98   100       99
1    2  deepak   95    96       92
2    3    itty   95    96       94
3    4  rossum   99    98       93

In [87]:
# cal the total marks
df["total"]=df["eng"]+df["math"]+df["science"]
print(df)

   sno    name  eng  math  science  total
0    1  dhurvi   98   100       99    297
1    2  deepak   95    96       92    283
2    3    itty   95    96       94    285
3    4  rossum   99    98       93    290

In [88]:
# full marks subject wise
df["fullMarks"]=300
print(df)

   sno    name  eng  math  science  total  fullMarks
0    1  dhurvi   98   100       99    297        300
1    2  deepak   95    96       92    283        300
2    3    itty   95    96       94    285        300
3    4  rossum   99    98       93    290        300

In [89]:
# cal the %
df["percentage"]=round((df["total"]/df["fullMarks"])*100,2)
print(df)

   sno    name  eng  math  science  total  fullMarks  percentage
0    1  dhurvi   98   100       99    297        300       99.00
1    2  deepak   95    96       92    283        300       94.33
2    3    itty   95    96       94    285        300       95.00
3    4  rossum   99    98       93    290        300       96.67

In [90]:
# give the grade acording to %
# filtering the data

In [91]:
df.to_csv("D:\\clone\\DataAnalyst_DPK\\files\\ModifiedstudentData.csv")

In [92]:
print(df)

   sno    name  eng  math  science  total  fullMarks  percentage
0    1  dhurvi   98   100       99    297        300       99.00
1    2  deepak   95    96       92    283        300       94.33
2    3    itty   95    96       94    285        300       95.00
3    4  rossum   99    98       93    290        300       96.67

# Filtering the data in pandas

In [93]:
# example on filtering the data

In [94]:
# get the data
df=pd.read_csv("D:\\clone\\DataAnalyst_DPK\\files\\emp.csv")
print(df)

   sno     name   sal  comm         com
0  100   rossum  8000    80         psf
1  200   travis  3500    35       numpy
2  300   kinney  4000    65      pandas
3  400  brendam  6000    50  javascript
4  500    rohit  5000    80       react
5  600   hunter  5500    90        next

In [95]:
df["sal"]>5000

0     True
1    False
2    False
3     True
4    False
5     True
Name: sal, dtype: bool

In [96]:
# it will give the boolean array

In [97]:
df[df["sal"]>5000]

   sno     name   sal  comm         com
0  100   rossum  8000    80         psf
3  400  brendam  6000    50  javascript
5  600   hunter  5500    90        next

In [98]:
# get the names of those employee whose salary range between 5000 and 9000
(df["sal"]>=5000) & (df["sal"]<9000)

0     True
1    False
2    False
3     True
4     True
5     True
Name: sal, dtype: bool

In [99]:
# get the data
df[(df["sal"]>=5000) & (df["sal"]<9000)]

   sno     name   sal  comm         com
0  100   rossum  8000    80         psf
3  400  brendam  6000    50  javascript
4  500    rohit  5000    80       react
5  600   hunter  5500    90        next

In [100]:
# print only name and sal
df[(df["sal"]>=5000) & (df["sal"]<9000)][["name","sal"]]

      name   sal
0   rossum  8000
3  brendam  6000
4    rohit  5000
5   hunter  5500

In [101]:
# get the emplyee name who only work in numpy
df["com"]=="numpy"

0    False
1     True
2    False
3    False
4    False
5    False
Name: com, dtype: bool

In [102]:
df[df["com"]=="numpy"][["name","sal"]]

     name   sal
1  travis  3500

In [103]:
#total sal paid to all the employee
df["sal"].sum()

np.int64(32000)

In [104]:
# find the emp who are working in numpy and react
(df["name"]=="react")| (df["name"]=="numpy")

0    False
1    False
2    False
3    False
4    False
5    False
Name: name, dtype: bool

In [105]:
df[(df["com"]=="react")| (df["com"]=="numpy")][["name","sal","com"]]

     name   sal    com
1  travis  3500  numpy
4   rohit  5000  react

In [106]:
for name in df[(df["com"]=="react")| (df["com"]=="numpy")]["name"]:
    print(name)

travis
rohit

In [107]:
# get he company name
df["com"]

0           psf
1         numpy
2        pandas
3    javascript
4         react
5          next
Name: com, dtype: object

In [108]:
for cname in df["com"]:
    print(cname)

psf
numpy
pandas
javascript
react
next

In [109]:
for cname in df["com"]:
    if cname in ["numpy","javascript"]:
        print(df)

   sno     name   sal  comm         com
0  100   rossum  8000    80         psf
1  200   travis  3500    35       numpy
2  300   kinney  4000    65      pandas
3  400  brendam  6000    50  javascript
4  500    rohit  5000    80       react
5  600   hunter  5500    90        next
   sno     name   sal  comm         com
0  100   rossum  8000    80         psf
1  200   travis  3500    35       numpy
2  300   kinney  4000    65      pandas
3  400  brendam  6000    50  javascript
4  500    rohit  5000    80       react
5  600   hunter  5500    90        next

In [110]:
# another method
x=dict(df[["name","com"]])
print(x)

{'name': 0     rossum
1     travis
2     kinney
3    brendam
4      rohit
5     hunter
Name: name, dtype: object, 'com': 0           psf
1         numpy
2        pandas
3    javascript
4         react
5          next
Name: com, dtype: object}

In [111]:
# get the data via loc
df.loc[(df["com"]=="numpy")| (df["com"]=="javascript")]["name"]

1     travis
3    brendam
Name: name, dtype: object

In [112]:
import numpy as np
import pandas as pd

In [113]:
# get the data
df=pd.read_csv("D:\\clone\\DataAnalyst_DPK\\files\\Modifiedemp.csv")
print(df)

   Unnamed: 0  sno     name   sal  comm         com  totalSal
0           0  100   rossum  8000    80         psf      8080
1           1  200   travis  3500    35       numpy      3535
2           2  300   kinney  4000    65      pandas      4065
3           3  400  brendam  6000    50  javascript      6050
4           4  500    rohit  5000    80       react      5080
5           5  600   hunter  5500    90        next      5590

# Data filtering an Updation on DataFrame object

In [114]:
# conditional based updation

In [115]:
df.columns

Index(['Unnamed: 0', 'sno', 'name', 'sal', 'comm', 'com', 'totalSal'], dtype='object')

In [116]:
df.loc[df["com"]=="psf"]

   Unnamed: 0  sno    name   sal  comm  com  totalSal
0           0  100  rossum  8000    80  psf      8080

In [117]:
#to get only names
df.loc[df["com"]=="psf"]["name"]

0    rossum
Name: name, dtype: object

In [118]:
# count the number of people
len(df.loc[df["com"]=="psf"]["name"])

1

In [119]:
# update "psf" as "python software foundation"
df.loc[df["com"]=="psf",["com"]]="python software foundation"
print(df)

   Unnamed: 0  sno     name   sal  comm                         com  totalSal
0           0  100   rossum  8000    80  python software foundation      8080
1           1  200   travis  3500    35                       numpy      3535
2           2  300   kinney  4000    65                      pandas      4065
3           3  400  brendam  6000    50                  javascript      6050
4           4  500    rohit  5000    80                       react      5080
5           5  600   hunter  5500    90                        next      5590

In [120]:
# pick the person who have commision 80

df.loc[(df["name"]=="rohit") & (df["comm"]==80)]

   Unnamed: 0  sno   name   sal  comm    com  totalSal
4           4  500  rohit  5000    80  react      5080

In [121]:
#syntax
# dataframeObj.loc[(compound condition),["col name","colname2",..]]=expression

In [122]:
# give the grading 
# 100-75 distinction
# 75-65 first
# 65-55 second
# <60 third

In [123]:
# get the data
df=pd.read_csv("D:\\clone\\DataAnalyst_DPK\\files\\student-dataset.csv")
print(df)

      id               name               nationality                 city  \
0      0          Kiana Lor                     China               Suzhou
1      1     Joshua Lonaker  United States of America        Santa Clarita
2      2      Dakota Blanco  United States of America              Oakland
3      3    Natasha Yarusso  United States of America        Castro Valley
4      4     Brooke Cazares                    Brazil  São José dos Campos
..   ...                ...                       ...                  ...
302  302        Austin Haas  United States of America             Columbus
303  303    Madison Fithian  United States of America          Los Angeles
304  304  Zachary Mulvahill  United States of America          Los Angeles
305  305   Eliana Michelsen  United States of America              Oakland
306  306    Dane Whittemore                    Canada              Toronto

     latitude  longitude gender  ethnic.group  age  english.grade  math.grade  \
0       31.31     120.62      F           NaN   22            3.5         3.7
1       34.39    -118.54      M           NaN   22            2.9         3.2
2       37.80    -122.27      F           NaN   22            3.9         3.8
3       37.69    -122.09      F           NaN   20            3.3         2.8
4      -23.18     -45.88      F           NaN   21            3.7         2.6
..        ...        ...    ...           ...  ...            ...         ...
302     39.96     -83.00      M           NaN   20            3.6         3.7
303     34.05    -118.24      F           NaN   20            3.6         3.9
304     34.05    -118.24      M           NaN   20            3.2         3.4
305     37.80    -122.27      F           NaN   23            3.0         2.8
306     43.67     -79.42      M           NaN   21            3.8         3.2

     sciences.grade  language.grade  portfolio.rating  coverletter.rating  \
0               3.1             1.0                 4                 4.0
1               3.6             5.0                 5                 4.0
2               3.2             5.0                 3                 3.0
3               3.2             5.0                 5                 2.0
4               3.4             1.0                 4                 4.0
..              ...             ...               ...                 ...
302             3.1             5.0                 4                 5.0
303             4.0             5.0                 5                 5.0
304             3.9             5.0                 5                 5.0
305             2.9             5.0                 4                 4.0
306             4.0             5.0                 5                 4.0

     refletter.rating
0                   4
1                   5
2                   4
3                   4
4                   5
..                ...
302                 5
303                 3
304                 3
305                 5
306                 5

[307 rows x 16 columns]

In [124]:
df.columns

Index(['id', 'name', 'nationality', 'city', 'latitude', 'longitude', 'gender',
       'ethnic.group', 'age', 'english.grade', 'math.grade', 'sciences.grade',
       'language.grade', 'portfolio.rating', 'coverletter.rating',
       'refletter.rating'],
      dtype='object')

In [125]:
df["english.grade"]

0      3.5
1      2.9
2      3.9
3      3.3
4      3.7
      ...
302    3.6
303    3.6
304    3.2
305    3.0
306    3.8
Name: english.grade, Length: 307, dtype: float64

In [126]:
# 1.5 lec31
# df.loc[((df["percent"]>=60) & (df["percent"]<65)),["grade"]]="second"
# print(df)

In [ ]:
#lec 31 complted